--宠物染色
PetColor = {}

--染色道具配置
PetColor.Item = {
    ["红色坐骑染料"] = {
        Color = {r = 5 , g = -2 , b = -2}, --RGB颜色增值（负数为减小）
        --ColorAdd = {r = 0 , g = 0 , b = 0}, --附加RGB颜色增值（负数为减小）
    },
    ["绿色坐骑染料"] = {
        Color = {r = -2 , g = 5 , b = -2},
    },
    ["蓝色坐骑染料"] = {
        Color = {r = -2 , g = -2 , b = 5},
    },
    ["黑色坐骑染料"] = {
        Color = {r = -5 , g = -5 , b = -5},
    },
    ["白色坐骑染料"] = {
        Color = {r = 5 , g = 5 , b = 5},
    },
    ["坐骑复原染料"] = {},
}

--染色类型 1：叠加 2：替换 (叠加染色在渐变色模型上可能会产生不自然的色彩过度，替换染色可能会覆盖掉部分模型细节纹理)
--如果宠物自带染色配置，如变异宠物，则默认使用替换类型染色
PetColor.ColorType = {
    [5101] = 1,
    [5163] = 1,
    [5164] = 1,
    [5249] = 1,
    [5250] = 1,
    [5252] = 1,
    [5253] = 1,
    [5254] = 1,
    [5255] = 1,
    [5262] = 1,
    [5263] = 1,
    [5266] = 1,
    [5267] = 1,
    [5102] = 1,
    [5103] = 1,
    [5104] = 1,
    [5107] = 1,
    [5109] = 1,
    [5111] = 1,
    [5112] = 1,
    [5115] = 1,
    [5116] = 1,
    [5117] = 1,
    [5118] = 1,
    [5119] = 1,
    [5120] = 1,
    [5122] = 1,
    [5125] = 1,
    [5126] = 1,
    [5130] = 1,
    [5131] = 1,
    [5133] = 1,
    [5134] = 1,
    [5136] = 1,
    [5137] = 1,
    [5138] = 1,
    [5140] = 1,
    [5141] = 1,
    [5145] = 1,
    [5146] = 1,
    [5149] = 1,
    [5150] = 1,
    [5153] = 1,
    [5154] = 1,
    [5155] = 1,
    [5161] = 1,
    [5162] = 1,
    [5271] = 1,
    [5286] = 1,
    [5287] = 1,
    [5291] = 1,
    [5292] = 1,
    [5297] = 1,
    [5300] = 1,
    [5302] = 1,
    [5303] = 1,
    [5304] = 1,
    [5307] = 1,
    [5312] = 1,
    [5314] = 1,
    [5315] = 1,
    [5318] = 1,
    [5319] = 1,
    [5985] = 1,
    [5989] = 2,
    [5995] = 1,
    [5997] = 1,
    [5998] = 1,
    [5999] = 2,
    [5990] = 1,
    [5991] = 1,
    [5994] = 1,

    [5402] = 1,
    [5408] = 1,
    [5406] = 1,
    [5403] = 1,
    [5405] = 1,
    [5409] = 2,
    [5404] = 1,
    [5411] = 1,
    [5407] = 1,
	[5414] = 1,
	[5415] = 1,
}

--染色模板配置
PetColor.Plan = { --[模型ID] = {模板配置}
    [5101] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5163] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5164] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5249] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5250] = {
        {
            Name = "方案1",
            Part1 = {"黑色坐骑染料",35},
            Part2 = {"红色坐骑染料",40,"绿色坐骑染料",26,"黑色坐骑染料",3},
        },
        {
            Name = "方案2",
            Part1 = {"白色坐骑染料",40},
            Part2 = {"红色坐骑染料",25},
        },
    },
    [5252] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5253] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5254] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5255] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5262] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5263] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5266] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5267] = {
        {
            Name = "熔岩",
            Part1 = {"黑色坐骑染料",25},
            Part2 = {"红色坐骑染料",15},
        },
        {
            Name = "至高",
            Part1 = {"白色坐骑染料",20},
            Part2 = {"黑色坐骑染料",30},
        },
    },
    [5102] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5103] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5104] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5107] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5109] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5111] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5112] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5115] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5116] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5117] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5118] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5119] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5120] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5122] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5125] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5126] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5130] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5131] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5133] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5134] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5136] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5137] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5138] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5140] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5141] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5145] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5146] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5149] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5150] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5153] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5154] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5155] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5161] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5162] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5271] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5286] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5287] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5291] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5292] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5297] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5300] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5302] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5303] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5304] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5307] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5312] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5314] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5315] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5318] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5319] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",5},
        },
    },
    [5985] = {
        {
            Name = "黑化",
            Part1 = {"黑色坐骑染料",30},
            Part2 = {"黑色坐骑染料",20},
        },
        {
            Name = "狂狮",
            Part1 = {"红色坐骑染料",12,"绿色坐骑染料",20},
            Part2 = {"白色坐骑染料",10},
        },
    },
    [5989] = {
        {
            Name = "方案1",
            Part1 = {"红色坐骑染料",13,"绿色坐骑染料",25},
            Part2 = {"黑色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"绿色坐骑染料",21,"蓝色坐骑染料",21,"黑色坐骑染料",10},
            Part2 = {"红色坐骑染料",30,"绿色坐骑染料",15,"黑色坐骑染料",10},
        },
    },
    [5995] = {
        {
            Name = "方案1",
            Part1 = {"绿色坐骑染料",20,"蓝色坐骑染料",25},
            Part2 = {"红色坐骑染料",10,"绿色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"红色坐骑染料",50},
        },
    },
    [5997] = {
        {
            Name = "方案1",
            Part1 = {"红色坐骑染料",10,"绿色坐骑染料",20,"白色坐骑染料",15},
            Part2 = {"红色坐骑染料",35},
        },
        {
            Name = "方案2",
            Part1 = {"绿色坐骑染料",25},
            Part2 = {"蓝色坐骑染料",10,"白色坐骑染料",5},
        },
    },
    [5998] = {
        {
            Name = "金犬",
            Part1 = {"红色坐骑染料",30,"绿色坐骑染料",20,"黑色坐骑染料",10},
            Part2 = {"红色坐骑染料",15},
        },
        {
            Name = "菜狗",
            Part1 = {"绿色坐骑染料",40,"蓝色坐骑染料",10},
            Part2 = {"绿色坐骑染料",25,"白色坐骑染料",30},
        },
    },
    [5999] = {
        {
            Name = "方案1",
            Part1 = {"红色坐骑染料",10},
            Part2 = {"蓝色坐骑染料",20},
        },
        {
            Name = "方案2",
            Part1 = {"蓝色坐骑染料",20,"白色坐骑染料",10},
            Part2 = {"绿色坐骑染料",20,"蓝色坐骑染料",10},
        },
    },
    [5990] = {
        {
            Name = "方案1",
            Part1 = {"黑色坐骑染料",25},
            Part2 = {"绿色坐骑染料",10,"白色坐骑染料",15},
        },
        {
            Name = "方案2",
            Part1 = {"白色坐骑染料",15},
            Part2 = {"蓝色坐骑染料",30},
        },
    },
    [5991] = {
        {
            Name = "方案1",
            Part1 = {"红色坐骑染料",25},
            Part2 = {"绿色坐骑染料",30},
        },
        {
            Name = "方案2",
            Part1 = {"蓝色坐骑染料",15,"白色坐骑染料",10},
            Part2 = {"蓝色坐骑染料",20,"白色坐骑染料",10},
        },
    },
    [5994] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",15},
            Part2 = {"蓝色坐骑染料",25},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",35,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",25},
        },
    },
    [5402] = {
        {
            Name = "方案1",
            Part1 = {"红色坐骑染料",40,"黑色坐骑染料",10},
            Part2 = {"红色坐骑染料",30},
            Part3 = {"红色坐骑染料",20},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",15,"蓝色坐骑染料",20},
            Part2 = {"蓝色坐骑染料",20},
            Part3 = {"蓝色坐骑染料",15},
        },
    },
    [5408] = {
        {
            Name = "方案1",
            Part1 = {"红色坐骑染料",20,"黑色坐骑染料",10},
            Part2 = {"黑色坐骑染料",15},
            Part3 = {"红色坐骑染料",30},
        },
        {
            Name = "方案2",
            Part1 = {"黑色坐骑染料",20},
            Part2 = {"黑色坐骑染料",25},
            Part3 = {"红色坐骑染料",30,"蓝色坐骑染料",15,"黑色坐骑染料",5},
        },
    },
    [5406] = {
        {
            Name = "小白",
            Part1 = {"红色坐骑染料",7,"蓝色坐骑染料",8,"白色坐骑染料",17},
            Part2 = {"蓝色坐骑染料",15},
            Part3 = {"红色坐骑染料",10,"白色坐骑染料",20},
        },
        {
            Name = "小红",
            Part1 = {"红色坐骑染料",25,"蓝色坐骑染料",10},
            Part2 = {"黑色坐骑染料",25},
            Part3 = {"红色坐骑染料",30,"蓝色坐骑染料",15},
        },
    },
    [5403] = {
        {
            Name = "青柚",
            Part1 = {"红色坐骑染料",10,"绿色坐骑染料",10},
            Part2 = {"绿色坐骑染料",15,"黑色坐骑染料",10},
        },
        {
            Name = "红柚",
            Part1 = {"绿色坐骑染料",15,"黑色坐骑染料",10},
            Part2 = {"红色坐骑染料",30,"蓝色坐骑染料",15},
        },
    },
    [5405] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",20,"绿色坐骑染料",5},
            Part2 = {"蓝色坐骑染料",25},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",10,"蓝色坐骑染料",10,"白色坐骑染料",10},
            Part2 = {"红色坐骑染料",30},
        },
    },
    [5409] = {
        {
            Name = "方案1",
            Part1 = {"蓝色坐骑染料",20},
            Part2 = {"绿色坐骑染料",15,"蓝色坐骑染料",30},
            Part3 = {"绿色坐骑染料",5,"蓝色坐骑染料",20,"白色坐骑染料",3},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",15,"黑色坐骑染料",10},
            Part2 = {"蓝色坐骑染料",5,"白色坐骑染料",15},
            Part3 = {"白色坐骑染料",2},
        },
    },
    [5404] = {
        {
            Name = "方案1",
            Part1 = {"红色坐骑染料",10},
            Part2 = {"绿色坐骑染料",15,"黑色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"蓝色坐骑染料",10,"白色坐骑染料",20},
            Part2 = {"红色坐骑染料",45},
        },
    },
    [5411] = {
        {
            Name = "方案1",
            Part1 = {"红色坐骑染料",20,"蓝色坐骑染料",20,"黑色坐骑染料",10},
        },
        {
            Name = "方案2",
            Part1 = {"红色坐骑染料",45,"黑色坐骑染料",10},
        },
    },
    [5407] = {
        {
            Name = "方案1",
            Part1 = {"红色坐骑染料",20,"黑色坐骑染料",20},
            Part2 = {"红色坐骑染料",15},
        },
        {
            Name = "方案2",
            Part1 = {"绿色坐骑染料",15,"蓝色坐骑染料",30},
            Part2 = {"蓝色坐骑染料",15,"白色坐骑染料",10},
        },
    },
	[5414] = {
        {
            Name = "金犬",
            Part1 = {"红色坐骑染料",30,"绿色坐骑染料",20,"黑色坐骑染料",10},
            Part2 = {"红色坐骑染料",15},
        },
        {
            Name = "菜狗",
            Part1 = {"绿色坐骑染料",40,"蓝色坐骑染料",10},
            Part2 = {"绿色坐骑染料",25,"白色坐骑染料",30},
        },
    },
	[5415] = {
        {
            Name = "金犬",
            Part1 = {"红色坐骑染料",30,"绿色坐骑染料",20,"黑色坐骑染料",10},
            Part2 = {"红色坐骑染料",15},
        },
        {
            Name = "菜狗",
            Part1 = {"绿色坐骑染料",40,"蓝色坐骑染料",10},
            Part2 = {"绿色坐骑染料",25,"白色坐骑染料",30},
        },
    },
}

PetColor.BasalColor = { --[模型ID] = {模型基础颜色}
    [5101] = {
        Part1 = {
            Color = {r = 107 , g = 158 , b = 26},
        },
        Part2 = {
            Color = {r = 128 , g = 95 , b = 13},
        },
    },
    [5163] = {Part1 = {Color = {r = 31,g = 117,b = 160}},Part2 = {Color = {r = 45,g = 53,b = 127}}},
    [5164] = {Part1 = {Color = {r = 101,g = 167,b = 142}},Part2 = {Color = {r = 134,g = 78,b = 42}}},
    [5249] = {Part1 = {Color = {r = 171,g = 52,b = 39}},Part2 = {Color = {r = 226,g = 142,b = 120}}},
    [5250] = {Part1 = {Color = {r = 201,g = 50,b = 64}},Part2 = {Color = {r = 125,g = 187,b = 204}}},
    [5252] = {Part1 = {Color = {r = 235,g = 205,b = 73}},Part2 = {Color = {r = 219,g = 50,b = 34}}},
    [5253] = {Part1 = {Color = {r = 136,g = 252,b = 244}},Part2 = {Color = {r = 139,g = 197,b = 29}}},
    [5254] = {Part1 = {Color = {r = 231,g = 192,b = 76}},Part2 = {Color = {r = 189,g = 11,b = 1}}},
    [5255] = {Part1 = {Color = {r = 241,g = 136,b = 194}},Part2 = {Color = {r = 106,g = 254,b = 254}}},
    [5262] = {Part1 = {Color = {r = 137,g = 170,b = 198}},Part2 = {Color = {r = 36,g = 108,b = 213}}},
    [5263] = {Part1 = {Color = {r = 148,g = 212,b = 234}},Part2 = {Color = {r = 94,g = 52,b = 52}}},
    [5266] = {Part1 = {Color = {r = 218,g = 121,b = 60}},Part2 = {Color = {r = 60,g = 60,b = 35}}},
    [5267] = {Part1 = {Color = {r = 211,g = 207,b = 222}},Part2 = {Color = {r = 196,g = 56,b = 55}}},
    [5102] = {Part1 = {Color = {r = 173,g = 105,b = 105}},Part2 = {Color = {r = 201,g = 56,b = 64}}},
    [5103] = {Part1 = {Color = {r = 168,g = 124,b = 108}},Part2 = {Color = {r = 216,g = 211,b = 203}}},
    [5104] = {Part1 = {Color = {r = 189,g = 106,b = 48}},Part2 = {Color = {r = 72,g = 47,b = 88}}},
    [5107] = {Part1 = {Color = {r = 131,g = 98,b = 172}},Part2 = {Color = {r = 121,g = 146,b = 189}}},
    [5109] = {Part1 = {Color = {r = 230,g = 110,b = 60}},Part2 = {Color = {r = 42,g = 107,b = 156}}},
    [5111] = {Part1 = {Color = {r = 69,g = 176,b = 177}},Part2 = {Color = {r = 83,g = 124,b = 57}}},
    [5112] = {Part1 = {Color = {r = 113,g = 38,b = 28}},Part2 = {Color = {r = 244,g = 99,b = 148}}},
    [5115] = {Part1 = {Color = {r = 193,g = 177,b = 182}},Part2 = {Color = {r = 76,g = 174,b = 241}}},
    [5116] = {Part1 = {Color = {r = 236,g = 120,b = 71}},Part2 = {Color = {r = 191,g = 35,b = 29}}},
    [5117] = {Part1 = {Color = {r = 233,g = 108,b = 69}},Part2 = {Color = {r = 241,g = 159,b = 109}}},
    [5118] = {Part1 = {Color = {r = 190,g = 125,b = 25}},Part2 = {Color = {r = 231,g = 214,b = 150}}},
    [5119] = {Part1 = {Color = {r = 101,g = 217,b = 218}},Part2 = {Color = {r = 92,g = 107,b = 115}}},
    [5120] = {Part1 = {Color = {r = 183,g = 43,b = 34}},Part2 = {Color = {r = 163,g = 109,b = 42}}},
    [5122] = {Part1 = {Color = {r = 195,g = 140,b = 65}},Part2 = {Color = {r = 174,g = 219,b = 91}}},
    [5125] = {Part1 = {Color = {r = 237,g = 228,b = 57}},Part2 = {Color = {r = 203,g = 39,b = 16}}},
    [5126] = {Part1 = {Color = {r = 78,g = 149,b = 90}},Part2 = {Color = {r = 217,g = 176,b = 93}}},
    [5130] = {Part1 = {Color = {r = 161,g = 21,b = 16}},Part2 = {Color = {r = 233,g = 233,b = 212}}},
    [5131] = {Part1 = {Color = {r = 33,g = 89,b = 197}},Part2 = {Color = {r = 127,g = 203,b = 231}}},
    [5133] = {Part1 = {Color = {r = 80,g = 146,b = 210}},Part2 = {Color = {r = 188,g = 206,b = 214}}},
    [5134] = {Part1 = {Color = {r = 51,g = 82,b = 127}},Part2 = {Color = {r = 138,g = 42,b = 36}}},
    [5136] = {Part1 = {Color = {r = 125,g = 195,b = 233}},Part2 = {Color = {r = 195,g = 204,b = 215}}},
    [5137] = {Part1 = {Color = {r = 51,g = 51,b = 92}},Part2 = {Color = {r = 54,g = 112,b = 224}}},
    [5138] = {Part1 = {Color = {r = 51,g = 149,b = 223}},Part2 = {Color = {r = 77,g = 159,b = 211}}},
    [5140] = {Part1 = {Color = {r = 243,g = 45,b = 23}},Part2 = {Color = {r = 113,g = 47,b = 30}}},
    [5141] = {Part1 = {Color = {r = 86,g = 70,b = 53}},Part2 = {Color = {r = 113,g = 97,b = 121}}},
    [5145] = {Part1 = {Color = {r = 61,g = 152,b = 24}},Part2 = {Color = {r = 70,g = 29,b = 51}}},
    [5146] = {Part1 = {Color = {r = 37,g = 54,b = 160}},Part2 = {Color = {r = 55,g = 228,b = 154}}},
    [5149] = {Part1 = {Color = {r = 174,g = 118,b = 201}},Part2 = {Color = {r = 177,g = 22,b = 6}}},
    [5150] = {Part1 = {Color = {r = 215,g = 55,b = 214}},Part2 = {Color = {r = 46,g = 120,b = 194}}},
    [5153] = {Part1 = {Color = {r = 56,g = 170,b = 158}},Part2 = {Color = {r = 75,g = 105,b = 171}}},
    [5154] = {Part1 = {Color = {r = 116,g = 105,b = 34}},Part2 = {Color = {r = 246,g = 235,b = 126}}},
    [5155] = {Part1 = {Color = {r = 52,g = 148,b = 173}},Part2 = {Color = {r = 19,g = 191,b = 164}}},
    [5161] = {Part1 = {Color = {r = 97,g = 141,b = 34}},Part2 = {Color = {r = 172,g = 119,b = 45}}},
    [5162] = {Part1 = {Color = {r = 161,g = 179,b = 44}},Part2 = {Color = {r = 217,g = 209,b = 150}}},
    [5271] = {Part1 = {Color = {r = 39,g = 130,b = 154}},Part2 = {Color = {r = 164,g = 90,b = 79}}},
    [5286] = {Part1 = {Color = {r = 155,g = 80,b = 31}},Part2 = {Color = {r = 182,g = 182,b = 190}}},
    [5287] = {Part1 = {Color = {r = 35,g = 43,b = 51}},Part2 = {Color = {r = 96,g = 111,b = 252}}},
    [5291] = {Part1 = {Color = {r = 204,g = 85,b = 39}},Part2 = {Color = {r = 182,g = 91,b = 109}}},
    [5292] = {Part1 = {Color = {r = 73,g = 65,b = 197}},Part2 = {Color = {r = 132,g = 168,b = 215}}},
    [5297] = {Part1 = {Color = {r = 183,g = 183,b = 101}},Part2 = {Color = {r = 236,g = 254,b = 7}}},
    [5300] = {Part1 = {Color = {r = 101,g = 174,b = 223}},Part2 = {Color = {r = 111,g = 148,b = 187}}},
    [5302] = {Part1 = {Color = {r = 115,g = 63,b = 52}},Part2 = {Color = {r = 151,g = 203,b = 123}}},
    [5303] = {Part1 = {Color = {r = 212,g = 179,b = 97}},Part2 = {Color = {r = 60,g = 135,b = 117}}},
    [5304] = {Part1 = {Color = {r = 193,g = 84,b = 36}},Part2 = {Color = {r = 50,g = 42,b = 77}}},
    [5307] = {Part1 = {Color = {r = 194,g = 66,b = 15}},Part2 = {Color = {r = 134,g = 92,b = 59}}},
    [5312] = {Part1 = {Color = {r = 189,g = 51,b = 19}},Part2 = {Color = {r = 127,g = 68,b = 43}}},
    [5314] = {Part1 = {Color = {r = 118,g = 178,b = 209}},Part2 = {Color = {r = 50,g = 141,b = 125}}},
    [5315] = {Part1 = {Color = {r = 209,g = 74,b = 115}},Part2 = {Color = {r = 181,g = 25,b = 90}}},
    [5318] = {Part1 = {Color = {r = 69,g = 101,b = 160}},Part2 = {Color = {r = 85,g = 84,b = 191}}},
    [5319] = {Part1 = {Color = {r = 152,g = 127,b = 185}},Part2 = {Color = {r = 191,g = 18,b = 26}}},
    [5985] = {Part1 = {Color = {r = 123,g = 19,b = 19}},Part2 = {Color = {r = 52,g = 47,b = 73}}},
    [5989] = {Part1 = {Color = {r = 175,g = 0,b = 0}},Part2 = {Color = {r = 157,g = 141,b = 141}}},
    [5995] = {Part1 = {Color = {r = 213,g = 173,b = 48}},Part2 = {Color = {r = 2,g = 193,b = 185}}},
    [5997] = {Part1 = {Color = {r = 172,g = 29,b = 53}},Part2 = {Color = {r = 252,g = 222,b = 132}}},
    [5998] = {Part1 = {Color = {r = 243,g = 234,b = 209}},Part2 = {Color = {r = 193,g = 41,b = 34}}},
    [5999] = {Part1 = {Color = {r = 172,g = 57,b = 63}},Part2 = {Color = {r = 193,g = 16,b = 49}}},
    [5990] = {Part1 = {Color = {r = 109,g = 77,b = 93}},Part2 = {Color = {r = 180,g = 32,b = 15}}},
    [5991] = {Part1 = {Color = {r = 217,g = 151,b = 160}},Part2 = {Color = {r = 238,g = 78,b = 31}}},
    [5994] = {Part1 = {Color = {r = 229,g = 204,b = 148}},Part2 = {Color = {r = 149,g = 39,b = 26}}},

    [5402] = {Part1 = {Color = {r = 72,g = 196,b = 171}},Part2 = {Color = {r = 227,g = 203,b = 93}},Part3 = {Color = {r = 201,g = 165,b = 83}}},
    [5408] = {Part1 = {Color = {r = 179,g = 129,b = 48}},Part2 = {Color = {r = 163,g = 176,b = 60}},Part3 = {Color = {r = 252,g = 212,b = 96}}},
    [5406] = {Part1 = {Color = {r = 117,g = 167,b = 107}},Part2 = {Color = {r = 197,g = 166,b = 79}},Part3 = {Color = {r = 88,g = 172,b = 145}}},
    [5403] = {Part1 = {Color = {r = 234,g = 205,b = 52}},Part2 = {Color = {r = 238,g = 219,b = 99}}},
    [5405] = {Part1 = {Color = {r = 147,g = 98,b = 57}},Part2 = {Color = {r = 223,g = 142,b = 108}}},
    [5409] = {Part1 = {Color = {r = 156,g = 132,b = 63}},Part2 = {Color = {r = 163,g = 58,b = 58}},Part3 = {Color = {r = 168,g = 63,b = 60}}},
    [5404] = {Part1 = {Color = {r = 201,g = 153,b = 68}},Part2 = {Color = {r = 75,g = 182,b = 199}}},
    [5411] = {Part1 = {Color = {r = 13,g = 167,b = 170}}},
    [5407] = {Part1 = {Color = {r = 206,g = 60,b = 84}},Part2 = {Color = {r = 197,g = 174,b = 81}}},
	[5414] = {Part1 = {Color = {r = 172,g = 57,b = 63}},Part2 = {Color = {r = 193,g = 16,b = 49}}},
	[5415] = {Part1 = {Color = {r = 172,g = 57,b = 63}},Part2 = {Color = {r = 193,g = 16,b = 49}}},
}

--宠物部位配置（根据模型part配置，非必要不改动）
PetColor.PartConfig = {
    [5101] = {"部位一","部位二"},
    [5163] = {"部位一","部位二"},
    [5164] = {"部位一","部位二"},
    [5249] = {"部位一","部位二"},
    [5250] = {"部位一","部位二"},
    [5252] = {"部位一","部位二"},
    [5253] = {"部位一","部位二"},
    [5254] = {"部位一","部位二"},
    [5255] = {"部位一","部位二"},
    [5262] = {"部位一","部位二"},
    [5263] = {"部位一","部位二"},
    [5266] = {"部位一","部位二"},
    [5267] = {"部位一","部位二"},
    [5102] = {"部位一","部位二"},
    [5103] = {"部位一","部位二"},
    [5104] = {"部位一","部位二"},
    [5107] = {"部位一","部位二"},
    [5109] = {"部位一","部位二"},
    [5111] = {"部位一","部位二"},
    [5112] = {"部位一","部位二"},
    [5115] = {"部位一","部位二"},
    [5116] = {"部位一","部位二"},
    [5117] = {"部位一","部位二"},
    [5118] = {"部位一","部位二"},
    [5119] = {"部位一","部位二"},
    [5120] = {"部位一","部位二"},
    [5122] = {"部位一","部位二"},
    [5125] = {"部位一","部位二"},
    [5126] = {"部位一","部位二"},
    [5130] = {"部位一","部位二"},
    [5131] = {"部位一","部位二"},
    [5133] = {"部位一","部位二"},
    [5134] = {"部位一","部位二"},
    [5136] = {"部位一","部位二"},
    [5137] = {"部位一","部位二"},
    [5138] = {"部位一","部位二"},
    [5140] = {"部位一","部位二"},
    [5141] = {"部位一","部位二"},
    [5145] = {"部位一","部位二"},
    [5146] = {"部位一","部位二"},
    [5149] = {"部位一","部位二"},
    [5150] = {"部位一","部位二"},
    [5153] = {"部位一","部位二"},
    [5154] = {"部位一","部位二"},
    [5155] = {"部位一","部位二"},
    [5161] = {"部位一","部位二"},
    [5162] = {"部位一","部位二"},
    [5271] = {"部位一","部位二"},
    [5286] = {"部位一","部位二"},
    [5287] = {"部位一","部位二"},
    [5291] = {"部位一","部位二"},
    [5292] = {"部位一","部位二"},
    [5297] = {"部位一","部位二"},
    [5300] = {"部位一","部位二"},
    [5302] = {"部位一","部位二"},
    [5303] = {"部位一","部位二"},
    [5304] = {"部位一","部位二"},
    [5307] = {"部位一","部位二"},
    [5312] = {"部位一","部位二"},
    [5314] = {"部位一","部位二"},
    [5315] = {"部位一","部位二"},
    [5318] = {"部位一","部位二"},
    [5319] = {"部位一","部位二"},
    [5985] = {"部位一","部位二"},
    [5989] = {"部位一","部位二"},
    [5995] = {"部位一","部位二"},
    [5997] = {"部位一","部位二"},
    [5998] = {"部位一","部位二"},
    [5999] = {"部位一","部位二"},
    [5990] = {"部位一","部位二"},
    [5991] = {"部位一","部位二"},
    [5994] = {"部位一","部位二"},

    [5402] = {"部位一","部位二","部位三"},
    [5408] = {"部位一","部位二","部位三"},
    [5406] = {"部位一","部位二","部位三"},
    [5403] = {"部位一","部位二"},
    [5405] = {"部位一","部位二"},
    [5409] = {"部位一","部位二","部位三"},
    [5404] = {"部位一","部位二"},
    [5411] = {"部位一"},
    [5407] = {"部位一","部位二"},
	[5414] = {"部位一","部位二"},
	[5415] = {"部位一","部位二"},
}

--宠物模板预览
function PetColor.Pre_Plan(player,guid,plan_index)
    local pet = player:GetPetContainer(PET_CONTAINER_PANEL):GetPetByGUID(tonumber(guid))
    if not pet then
        sLuaApp:NotifyTipsMsg(player,"宠物未拥有，无法染色！")
        return
    end
    local model = PetColor.GetPetModel(pet)
    for part, _ in ipairs(PetColor.PartConfig[model]) do
        local color_list = PetColor.GetPlanColor(player, model,plan_index,part)
        local json_list = PetColor.GetJsonListPre(color_list,part,pet)
        local str = [[
            PetDyeingUI_UserDefined.ColorPreList]]..part..[[ = ]]..Lua_tools.serialize(json_list)..[[
            PetDyeingUI_UserDefined.RefreshIsPre()
        ]]
        sLuaApp:ShowForm(player, "脚本表单", str)
    end
end

--宠物模板染色
function PetColor.Dyeing_Plan(player,guid,index)
    local pet = player:GetPetContainer(PET_CONTAINER_PANEL):GetPetByGUID(tonumber(guid))
    if not pet then
        sLuaApp:NotifyTipsMsg(player,"宠物未拥有，无法染色！")
        return
    end
    local model = PetColor.GetPetModel(pet)
    local PlanConfig = PetColor.Plan[model][index]
    local all_item_key = {}
    local all_item_list = {}
    local part_num = Lua_tools.tablecount(PetColor.PartConfig[model])

    for i = 1, part_num do
        local plan_config = PlanConfig["Part"..i]
        for k, v in ipairs(plan_config) do
            if type(v) == "string" then
                all_item_key[v] = plan_config[k+1] + (all_item_key[v] or 0)
            end
        end
    end

    for k, v in pairs(all_item_key) do
        table.insert(all_item_list,k)
        table.insert(all_item_list,v)
    end

    local a = Lua_tools.IsItemEnough(player, all_item_list)
    if not a then
        --快速购买
		if OneKeyBuy then
			local defect_consume_tb = Lua_tools.GetDefectList(player, all_item_list)
			if OneKeyBuy.Main(player, defect_consume_tb) then
				return
			end
		end
        sLuaApp:NotifyTipsMsg(player,"染色物品数量不足！")
        return
    end

    for part, _ in ipairs(PetColor.PartConfig[model]) do
        local item_list = PetColor.Plan[model][index]["Part"..part]
        if item_list then
            for i, v in ipairs(item_list) do
                local item = ""
                local num = 1
                if type(v) == "string" then
                    item = v
                    if item ~= "" then
                        if not PetColor.Item[item] then
                            local itemData = ItemConfig.GetByKeyName(item)
                            sLuaApp:NotifyTipsMsg(player,itemData.Name.."无法给宠物染色！")
                            return
                        end
                        if item_list[i+1] then
                            if type(item_list[i+1]) == "number" then
                                num = item_list[i+1]
                            end
                        end
                        local log = sItemSystem:ConsumeItemWithId(player, sItemSystem:GetItemIdByKeyname(item), num, 3, "system", "宠物模板染色", "宠物模板染色消耗")
                        if log ~= 0 then
                            sLuaApp:LuaErr("PetColor.Dyeing_Plan ConsumeItemWithId Err , Log："..log)
                            return false
                        end 
                    end
                end
            end
        end
        local color_list = PetColor.GetPlanColor(player, model,index,part)
        pet:SetString("ColorJson_"..part,Lua_tools.serialize(color_list))
    end

    local json_list = PetColor.GetJsonList(pet,model)
    --sLuaApp:LuaErr(Lua_tools.serialize(json_list))
    pet:SetString("Model_DynJson1",  json.encode(json_list))
    sLogServerSystem:LogToServer(0,player,"宠物模板染色",0,0,pet:GetKeyName(),Lua_tools.serialize(json_list))
    sLuaApp:NotifyTipsMsg(player,"宠物染色成功！")
    local str = [[
        PetDyeingUI_UserDefined.ColorList = ]]..Lua_tools.serialize(json_list)..[[
        PetDyeingUI_UserDefined.Refresh()
    ]]
    sLuaApp:ShowForm(player, "脚本表单", str)
end

function PetColor.GetPlanColor(player,model,plan_index,part)
    plan_index = tonumber(plan_index)
    local item_list = PetColor.Plan[model][plan_index]["Part"..part]
    local color_list = Lua_tools.CopyTable(PetColor.BasalColor[model]["Part"..part])
    if item_list then
        for i, v in ipairs(item_list) do
            local item = ""
            local num = 1
            if type(v) == "string" then
                item = v
                if item ~= "" then
                    if not PetColor.Item[item] then
                        local itemData = ItemConfig.GetByKeyName(item)
                        sLuaApp:NotifyTipsMsg(player,itemData.Name.."无法给宠物染色！")
                        return
                    end
                    if item_list[i+1] then
                        if type(item_list[i+1]) == "number" then
                            num = item_list[i+1]
                        end
                    end
                    for k, list in pairs(PetColor.Item[item]) do
                        if not color_list[k] then
                            color_list[k] = {}
                        end
                        for key, value in pairs(list) do
                            color_list[k][key] = value*num + (color_list[k][key] or 0)
                        end
                    end
                end
            end
        end
    end
    for k, v in pairs(color_list) do
        for n, m in pairs(v) do
            if m < 0 then
                color_list[k][n] = 0
            elseif m > 255 then
                color_list[k][n] = 255
            end 
        end
    end
    return color_list
end

function PetColor.GetData(player,guid)
    local pet = player:GetPetContainer(PET_CONTAINER_PANEL):GetPetByGUID(tonumber(guid))
    if not pet then
        sLuaApp:NotifyTipsMsg(player,"宠物未拥有，无法染色！")
        return
    end
    local model = PetColor.GetPetModel(pet)
    local JsonList = PetColor.GetJsonList(pet,model)
    local str = [[
        PetDyeingUI_UserDefined.ColorList = ]]..Lua_tools.serialize(JsonList)..[[
        PetDyeingUI_UserDefined.Refresh()
    ]]
    sLuaApp:ShowForm(player, "脚本表单", str)
end

--宠物自定义染色
function PetColor.Dyeing_Item(player,guid,part,item_str,is_pre)
    local pet = player:GetPetContainer(PET_CONTAINER_PANEL):GetPetByGUID(tonumber(guid))
    if not pet then
        sLuaApp:NotifyTipsMsg(player,"宠物未拥有，无法染色！")
        return
    end
    local petData = PetConfig.GetByKeyName(pet:GetKeyName())
    local model = petData.Model
    local color_list = {}
    if pet:GetString("ColorJson_"..part) ~= "" then
        color_list = assert(load("return " .. pet:GetString("ColorJson_"..part)))()
    else
        if petData.ColorId == 0 then
            if PetColor.BasalColor[model] then
                color_list = Lua_tools.CopyTable(PetColor.BasalColor[model]["Part"..part])
            end
        else
            local ColorData = ColorConfig.GetById(petData.ColorId)
            if ColorValueList[ColorData.AppearId] and ColorValueList[ColorData.AppearId]["IsFillPart"..part] == "True" then
                local H = tonumber(ColorValueList[ColorData.AppearId]["HOffset"..part])
                local S = tonumber(ColorValueList[ColorData.AppearId]["SOffset"..part])
                local V = tonumber(ColorValueList[ColorData.AppearId]["VOffset"..part])
                H,S,V = PetColor.HSVConvert_1(H,S,V)
                color_list["Color"] = {}
                color_list["Color"]["r"],color_list["Color"]["g"],color_list["Color"]["b"] =  Lua_tools.HSV2RGB(H,S,V)
            else
                color_list = Lua_tools.CopyTable(PetColor.BasalColor[model]["Part"..part])
            end
        end
    end
    --sLuaApp:LuaErr(Lua_tools.serialize(color_list))
    --local item_con = player:GetItemContainer(ITEM_CONTAINER_BAG)
    if item_str == "" then
        local json_list = {}
        if pet:GetString("ColorJson_"..part) ~= "" then
            json_list = PetColor.GetJsonListPre(color_list,part,pet)
        else
            json_list["IsAddColorFirst"..part] = false
            json_list["IsFillPart"..part] = false
        end
        local str = [[
            PetDyeingUI_UserDefined.ColorPreList]]..part..[[ = ]]..Lua_tools.serialize(json_list)..[[
            PetDyeingUI_UserDefined.RefreshIsPre()
        ]]
        sLuaApp:ShowForm(player, "脚本表单", str)
        return
    else
        local item_list = sLuaApp:StrSplit(item_str , "_")
        for i, v in ipairs(item_list) do
            if tonumber(v) then
                item_list[i] = tonumber(v)
            end
        end
        if item_list then
            --if not PetColor.IsItemEnough(player, item_list) then
            --    sLuaApp:NotifyTipsMsg(player,"物品数量不足，无法染色！")
            --    return
            --end
            local have_reset = false
            for i, v in ipairs(item_list) do
                if type(v) == "string" then
                    if v == "坐骑复原染料" then
                        have_reset = true
                    end
                end
            end
            if have_reset then
                if Lua_tools.tablecount(item_list) > 2 then
                    sLuaApp:NotifyTipsMsg(player,"漂洗液只能单独使用！")
                    return
                elseif Lua_tools.tablecount(item_list) == 2 then
                    if item_list[2] >= 2 then
                        sLuaApp:NotifyTipsMsg(player,"漂洗液只能单独使用！")
                        return
                    end
                end
            end

            for i, v in ipairs(item_list) do
	    		local item = ""
	    		local num = 1
                local bind = 3
	    		if type(v) == "string" then
	    			item = v
	    			if item ~= "" then
                        if not PetColor.Item[item] then
                            local itemData = ItemConfig.GetByKeyName(item)
                            sLuaApp:NotifyTipsMsg(player,itemData.Name.."无法给宠物染色！")
                            return
                        end
	    				if item_list[i+1] then
	    					if type(item_list[i+1]) == "number" then
	    						num = item_list[i+1]
	    					end
	    				end
                        if item_list[i+2] then
	    					if type(item_list[i+2]) == "number" then
	    						bind = item_list[i+2] + 1
	    					end
	    				end
                        --if item_con:GetItemAmountById(sItemSystem:GetItemIdByKeyname(item),bind) < num then
                        --    local itemData = ItemConfig.GetByKeyName(item)
                        --    sLuaApp:NotifyTipsMsg(player,itemData.Name.."数量不足！")
                        --    return
                        --end
                        if item == "坐骑复原染料" then
                            PetColor.ColorReset(player,pet,part,is_pre,item,bind)
                            return
                        end
                        if is_pre == 1 then
                            for k, list in pairs(PetColor.Item[item]) do
                                if not color_list[k] then
                                    color_list[k] = {}
                                end
                                for key, value in pairs(list) do
                                    color_list[k][key] = value*num + (color_list[k][key] or 0)
                                end
                            end
                        else
                            if not PetColor.IsItemEnough(player, item_list) then
                                sLuaApp:NotifyTipsMsg(player,"物品数量不足，无法染色！")
                                return
                            end
	    				    local log = sItemSystem:ConsumeItemWithId(player, sItemSystem:GetItemIdByKeyname(item), num, bind, "system", "宠物染色", "宠物染色消耗")
                            if log ~= 0 then
                                sLuaApp:LuaErr("PetColor.Dyeing_Item ConsumeItemWithId Err , Log："..log)
                                return false
	    				    else
                                for k, list in pairs(PetColor.Item[item]) do
                                    if not color_list[k] then
                                        color_list[k] = {}
                                    end
                                    for key, value in pairs(list) do
                                        color_list[k][key] = value*num + (color_list[k][key] or 0)
                                    end
                                end
                            end
                        end
	    			end
	    		end
            end
        end
    end
    for k, v in pairs(color_list) do
        for n, m in pairs(v) do
            if m < 0 then
                color_list[k][n] = 0
            elseif m > 255 then
                color_list[k][n] = 255
            end 
        end
    end
    local json_list = {}
    if is_pre == 1 then
        json_list = PetColor.GetJsonListPre(color_list,part,pet)
        local str = [[
            PetDyeingUI_UserDefined.ColorPreList]]..part..[[ = ]]..Lua_tools.serialize(json_list)..[[
            PetDyeingUI_UserDefined.RefreshIsPre()
        ]]
        --sLuaApp:LuaErr(str)
        sLuaApp:ShowForm(player, "脚本表单", str)
        return
    end
    pet:SetString("ColorJson_"..part,Lua_tools.serialize(color_list))
    json_list = PetColor.GetJsonList(pet,model)
    pet:SetString("Model_DynJson1",  json.encode(json_list))
    sLogServerSystem:LogToServer(0,player,"宠物自定义染色",0,0,guid.."_"..pet:GetName(),Lua_tools.serialize(json_list))
    --sLuaApp:LuaErr(Lua_tools.serialize(json_list))

    sLuaApp:NotifyTipsMsg(player,PetColor.PartConfig[model][part].."染色成功！")
    local str = [[
        PetDyeingUI_UserDefined.ColorList = ]]..Lua_tools.serialize(json_list)..[[
        PetDyeingUI_UserDefined.Refresh()
    ]]
    sLuaApp:ShowForm(player, "脚本表单", str)
end

--宠物复原
function PetColor.ColorReset(player,pet,part,is_pre,item,bind)
    if not pet then
        sLuaApp:NotifyTipsMsg(player,"宠物未拥有，无法染色！")
        return
    end
    --local model = PetColor.GetPetModel(pet)
    if is_pre == 1 then
        --local json_list = {}
        --json_list["IsAddColorFirst"..part] = false
        --json_list["IsFillPart"..part] = false
        --json_list["OriginalH"..part] = false
        local str = [[
            PetDyeingUI_UserDefined.ColorPreList]]..part..[[ = {}
            PetDyeingUI_UserDefined.RefreshIsPre()
        ]]
        sLuaApp:ShowForm(player, "脚本表单", str)
    else
        local log = sItemSystem:ConsumeItemWithId(player, sItemSystem:GetItemIdByKeyname(item), 1, bind, "system", "宠物染色", "宠物染色消耗")
        if log ~= 0 then
            sLuaApp:LuaErr("PetColor.ColorReset ConsumeItemWithId Err , Log："..log)
            return false
        else
            pet:SetString("ColorJson_"..part,"")
            pet:SetString("Model_DynJson1", "")
            sLuaApp:NotifyTipsMsg(player,"宠物染色成功！")
            local str = [[
                PetDyeingUI_UserDefined.ColorList = {}
                PetDyeingUI_UserDefined.Refresh()
            ]]
            sLuaApp:ShowForm(player, "脚本表单", str)
        end
    end
end

function PetColor.GetJsonList(pet,model)
    local new_list = {}
    local petData = PetConfig.GetByKeyName(pet:GetKeyName())

    for i, value in ipairs(PetColor.PartConfig[model]) do
        if pet:GetString("ColorJson_"..i) ~= "" then
            local list = assert(load("return " .. pet:GetString("ColorJson_"..i)))()
            if PetColor.ColorType[model] == 1 and PetColor.IsBasalColor(pet) then
                local a = {}
                local IsHSV = false
                if petData.ColorId == 0 then
                    a = Lua_tools.DupTable(PetColor.BasalColor[model]["Part"..i])
                else
                    local ColorData = ColorConfig.GetById(petData.ColorId)
                    if ColorValueList[ColorData.AppearId] and ColorValueList[ColorData.AppearId]["IsFillPart"..i] == "True" then
                        a["h"] = tonumber(ColorValueList[ColorData.AppearId]["HOffset"..i])
                        a["s"] = tonumber(ColorValueList[ColorData.AppearId]["SOffset"..i])
                        a["v"] = tonumber(ColorValueList[ColorData.AppearId]["VOffset"..i])
                        IsHSV = true
                    else
                        a = Lua_tools.DupTable(PetColor.BasalColor[model]["Part"..i])
                    end
                end
                local JsonList = PetColor.GetColorJsonList_1(list,a,i,IsHSV)
                for k, v in pairs(JsonList) do
                    new_list[k] = v
                end
            else
                local JsonList = PetColor.GetColorJsonList_2(list,i)
                for k, v in pairs(JsonList) do
                    new_list[k] = v
                end
            end
        else
            if petData.ColorId ~= 0 then
                local color_list = {}
                local ColorData = ColorConfig.GetById(petData.ColorId)
                if ColorValueList[ColorData.AppearId] and ColorValueList[ColorData.AppearId]["IsFillPart"..i] == "True" then
                    local H = tonumber(ColorValueList[ColorData.AppearId]["HOffset"..i])
                    local S = tonumber(ColorValueList[ColorData.AppearId]["SOffset"..i])
                    local V = tonumber(ColorValueList[ColorData.AppearId]["VOffset"..i])
                    new_list["IsFillPart"..i] = true
                    new_list["HOffset"..i] = H
                    new_list["SOffset"..i] = S
                    new_list["VOffset"..i] = V

                    H,S,V = PetColor.HSVConvert_1(H,S,V)
                    color_list["Color"] = {}
                    color_list["Color"]["r"],color_list["Color"]["g"],color_list["Color"]["b"] =  Lua_tools.HSV2RGB(H,S,V)
                    pet:SetString("ColorJson_"..i,Lua_tools.serialize(color_list))
                end
            end
        --    new_list["IsAddColorFirst"..i] = false
        --    new_list["IsFillPart"..i] = false
        end
    end
    return new_list
end

--染色预览
function PetColor.GetJsonListPre(list,part,pet)
    local petData = PetConfig.GetByKeyName(pet:GetKeyName())
    local model = petData.Model
    local new_list = {}

    if PetColor.ColorType[model] == 1 and PetColor.IsBasalColor(pet) then
        local a = {}
        local IsHSV = false
        if petData.ColorId == 0 then
            a = Lua_tools.DupTable(PetColor.BasalColor[model]["Part"..part])
        else
            local ColorData = ColorConfig.GetById(petData.ColorId)
            if ColorValueList[ColorData.AppearId] and ColorValueList[ColorData.AppearId]["IsFillPart"..part] == "True" then
                a["h"] = tonumber(ColorValueList[ColorData.AppearId]["HOffset"..part])
                a["s"] = tonumber(ColorValueList[ColorData.AppearId]["SOffset"..part])
                a["v"] = tonumber(ColorValueList[ColorData.AppearId]["VOffset"..part])
                IsHSV = true
            else
                a = Lua_tools.DupTable(PetColor.BasalColor[model]["Part"..part])
            end
        end
        new_list = PetColor.GetColorJsonList_1(list,a,part,IsHSV)
    else
        new_list = PetColor.GetColorJsonList_2(list,part)
    end
    return new_list
end

--获取宠物当前是否为基础染色
function PetColor.IsBasalColor(pet)
    local petData = PetConfig.GetByKeyName(pet:GetKeyName())
    if petData.ColorId ~= 0 then
        local ColorData = ColorConfig.GetById(petData.ColorId)
        for i = 1, 5 do
            if ColorValueList[ColorData.AppearId] and ColorValueList[ColorData.AppearId]["IsFillPart"..i] == "True" then
                return false
            end
        end
    end
    return true
end

function PetColor.GetColorJsonList_1(list,a,part,IsHSV)
    --sLuaApp:LuaErr(Lua_tools.serialize(a))
    local new_list = {}
    for k, rgb in pairs(list) do
        if k == "Color" then
            --if rgb.r ~= 0 or rgb.g ~= 0 or rgb.b ~= 0 then
            local h1,s1,v1 = 0,0,0
            local h,s,v = Lua_tools.RGB2HSV(rgb.r,rgb.g,rgb.b)
            if IsHSV then
                h1,s1,v1 = a["h"],a["s"],a["v"] --PetColor.HSVConvert_1(a["h"],a["s"],a["v"])
            else
                h1,s1,v1 = Lua_tools.RGB2HSV(a["Color"]["r"],a["Color"]["g"],a["Color"]["b"])
            end
            new_list["IsFillPart"..part] = true
            new_list["HOffset"..part] = h-h1
            new_list["SOffset"..part] = s-s1
            -- new_list["VOffset"..part] = v-0.9
            new_list["VOffset"..part] = v-v1
            new_list["OriginalH"..part] = true
            --end
        elseif k == "ColorAdd" then
            --if rgb.r ~= 0 or rgb.g ~= 0 or rgb.b ~= 0 then
                if not new_list["IsFillPart"..part] then
                    new_list["IsFillPart"..part] = true
                end
                local r,g,b = Lua_tools.FormatPercent(rgb.r/255, 4) , Lua_tools.FormatPercent(rgb.g/255, 4) , Lua_tools.FormatPercent(rgb.b/255, 4)
                new_list["IsAddColorFirst"..part] = true
                new_list["ColorAddFirst"..part] = {}
                new_list["ColorAddFirst"..part]["r"] = r
                new_list["ColorAddFirst"..part]["g"] = g
                new_list["ColorAddFirst"..part]["b"] = b
            --else
                --new_list["IsAddColorFirst"..part] = false
            --end
        end
    end
    --sLuaApp:LuaErr(Lua_tools.serialize(new_list))
    return new_list
end

function PetColor.GetColorJsonList_2(list,part)
    local new_list = {}
    for k, rgb in pairs(list) do
        if k == "Color" then
            --if rgb.r ~= 0 or rgb.g ~= 0 or rgb.b ~= 0 then
                local h,s,v = Lua_tools.RGB2HSV(rgb.r,rgb.g,rgb.b)
                new_list["IsFillPart"..part] = true
                new_list["HOffset"..part] = h
                new_list["SOffset"..part] = (s*1.5)-1
                -- new_list["VOffset"..i] = v-0.9
                new_list["VOffset"..part] = (v * 1.5) - 1
            --else
            --    iszero = true
            --end
        elseif k == "ColorAdd" then
            --if rgb.r ~= 0 or rgb.g ~= 0 or rgb.b ~= 0 then
                if not new_list["IsFillPart"..part] then
                    new_list["IsFillPart"..part] = true
                end
                local r,g,b = Lua_tools.FormatPercent(rgb.r/255, 4) , Lua_tools.FormatPercent(rgb.g/255, 4) , Lua_tools.FormatPercent(rgb.b/255, 4)
                new_list["IsAddColorFirst"..part] = true
                new_list["ColorAddFirst"..part] = {}
                new_list["ColorAddFirst"..part]["r"] = r
                new_list["ColorAddFirst"..part]["g"] = g
                new_list["ColorAddFirst"..part]["b"] = b
            --else
            --    new_list["IsAddColorFirst"..i] = false
            --end
        end
    end

    return new_list
end

---1-1 变为 0-1
function PetColor.HSVConvert_1(H,S,V)
    if H < 0 then
        H = 0
    end
    --H = (H+1)/2
    S = (S+1)/1.5
    V = (V+1)/1.5
    return H,S,V
end

--0-1 变为 -1-1
function PetColor.HSVConvert_2(H,S,V)
    H = (H*2)-1
    S = (S*2)-1
    V = (V*2)-1
    return H,S,V
end

function PetColor.GetPetModel(pet)
    if not pet then
        return
    end
    local petData = PetConfig.GetByKeyName(pet:GetKeyName())
    return petData.Model
end

function PetColor.Login(player)
    if not PetColor.PetColorItem then
        local coloritem = {}
        for k, v in pairs(PetColor.Item) do
            table.insert(coloritem,k)
        end
        PetColor.PetColorItem = Lua_tools.serialize(coloritem)
    end

    if not PetColor.PetColorPlan then
        PetColor.PetColorPlan = Lua_tools.serialize(PetColor.Plan)
    end
    if not PetColor.PetColorPart then
        PetColor.PetColorPart = Lua_tools.serialize(PetColor.PartConfig)
    end
    local str = [[
        if GlobalProcessing then
            GlobalProcessing.PetColorItem = ]]..PetColor.PetColorItem..[[
            GlobalProcessing.PetColorPlan = ]]..PetColor.PetColorPlan..[[
            GlobalProcessing.PetColorPart = ]]..PetColor.PetColorPart..[[
        end
    ]]
    sLuaApp:ShowForm(player, "脚本表单", str)
end

function PetColor.IsItemEnough(player, itemList)
	if itemList then
		for i,v in ipairs(itemList) do
			local item = ""
			local num = 1
            local bind = 3
			if type(v) == "string" then
				item = v
				if item ~= "" then
					if itemList[i+1] then
						if type(itemList[i+1]) == "number" then
							num = itemList[i+1]
						end
					end
                    if itemList[i+2] then
                        if type(itemList[i+2]) == "number" then
                            bind = itemList[i+2] + 1
                        end
                    end
					if sItemSystem:GetItemAmount(player, sItemSystem:GetItemIdByKeyname(item), bind) < num then
						--sLuaApp:NotifyTipsMsg(player, "您的材料不够，无法进行锻造")
						return false
					end
				end
			end
		end
	end
	return true
end

