--装备修理配置
RepairConfig = {}
--修理配置
--如果要使用全部修理，请在FunctionSwitch中打开开关，另外修理全部装备只支持消耗货币，其他功能如道具修理，修理失败次数，修理失败概率等均不生效，如果配置了其他内容，后果自负！

--传给客户端的修理说明
RepairConfig.RepairTips = "这里是修理说明"
--每次减几点
RepairConfig.DurableNum = 1
--减少的概率 10000 = 100% 
RepairConfig.CutProbability = 10000
--PVP失败减少概率 10000 = 100%
RepairConfig.CutProbability_PVP = 10000
--修理成功率 10000 = 100% 
RepairConfig.Rate = 10000
--修理货币类型，5为银币
RepairConfig.MoneyType = 5
--修理失败的次数上限库，配了就必须有，自行负责
RepairConfig.FailMax = {
	--[10191] = 3,
}
--装备修理需要的道具库，配了就必须有，自行负责
RepairConfig.Item = {
	--[10191] = {
	--	['ItemList'] = {"混元石",10},
	--	['SucceedItem'] = {"强化保固石",10},
	--},
}
--无限耐久度库
RepairConfig.NoDurable = {
	--[10191] = 1,
	--[10706] = 1,
	[9001] = 1,             --灵宝
	[9002] = 1,             --灵宝
	[9003] = 1,             --灵宝
	[9004] = 1,             --灵宝
	[9005] = 1,             --灵宝
	[9006] = 1,             --灵宝
	[9007] = 1,             --灵宝
	[9008] = 1,             --灵宝
	[9009] = 1,             --灵宝
	[9010] = 1,             --灵宝
	[9011] = 1,             --灵宝
	[9012] = 1,             --灵宝
	[9013] = 1,             --灵宝
	[9014] = 1,             --灵宝
	[9015] = 1,             --灵宝
	[9016] = 1,             --灵宝
	[9017] = 1,             --灵宝
	[9018] = 1,             --灵宝
	[9019] = 1,             --灵宝
	[9020] = 1,             --灵宝
	[9021] = 1,             --灵宝
	[9022] = 1,             --灵宝
	[9023] = 1,             --灵宝
	[9024] = 1,             --灵宝
	[9025] = 1,             --灵宝
	[9026] = 1,             --灵宝
	[9027] = 1,             --灵宝
	[9028] = 1,             --灵宝
	[9029] = 1,             --灵宝
	[9030] = 1,             --灵宝
	[9031] = 1,             --灵宝
	[9032] = 1,             --灵宝
	[9033] = 1,             --灵宝
}
--银币计算系数
RepairConfig.Coefficient= {
	[1] =   1,
	[10] =  5,
	[20] =  10,
	[30] =  20,
	[40] =  30,
	[50] =  40,
	[60] =  60,
	[70] =  80,
	[80] =  100,
	[90] =  150,
	[100] = 200,
	[110] = 300,
	[120] = 500,
}