--仙器生成属性随机 ，依赖 EquipReBuild 脚本
NoviceEquip = {}

NoviceEquip.List = {
	['新手重剑'] = {"物攻",1000, "风系法术伤害百分比",3000, "风系狂暴概率",500, "火系法术伤害百分比",3000, "火系狂暴概率",500, "混乱概率",800, "昏睡概率",800, "吸血法术伤害百分比",1000, "震摄法术伤害百分比",500, "鬼火系法术伤害百分比",1000},
	['新手扇子'] = {"物攻",1000, "风系法术伤害百分比",3000, "风系狂暴概率",500, "火系法术伤害百分比",3000, "火系狂暴概率",500, "混乱概率",800, "昏睡概率",800, "吸血法术伤害百分比",1000, "震摄法术伤害百分比",500, "鬼火系法术伤害百分比",1000},
	['新手笛子'] = {"物攻",1000, "风系法术伤害百分比",3000, "风系狂暴概率",500, "火系法术伤害百分比",3000, "火系狂暴概率",500, "混乱概率",800, "昏睡概率",800, "吸血法术伤害百分比",1000, "震摄法术伤害百分比",500, "鬼火系法术伤害百分比",1000},
	['新手阔刀'] = {"物攻",1000, "风系法术伤害百分比",3000, "风系狂暴概率",500, "火系法术伤害百分比",3000, "火系狂暴概率",500, "混乱概率",800, "昏睡概率",800, "吸血法术伤害百分比",1000, "震摄法术伤害百分比",500, "鬼火系法术伤害百分比",1000},
	['新手毛笔'] = {"物攻",1000, "风系法术伤害百分比",3000, "风系狂暴概率",500, "火系法术伤害百分比",3000, "火系狂暴概率",500, "混乱概率",800, "昏睡概率",800, "吸血法术伤害百分比",1000, "震摄法术伤害百分比",500, "鬼火系法术伤害百分比",1000},
	['新手长枪'] = {"物攻",1000, "风系法术伤害百分比",3000, "风系狂暴概率",500, "火系法术伤害百分比",3000, "火系狂暴概率",500, "混乱概率",800, "昏睡概率",800, "吸血法术伤害百分比",1000, "震摄法术伤害百分比",500, "鬼火系法术伤害百分比",1000},
	['新手爪刺'] = {"物攻",1000, "风系法术伤害百分比",3000, "风系狂暴概率",500, "火系法术伤害百分比",3000, "火系狂暴概率",500, "混乱概率",800, "昏睡概率",800, "吸血法术伤害百分比",1000, "震摄法术伤害百分比",500, "鬼火系法术伤害百分比",1000},
	['新手绣伞'] = {"物攻",1000, "风系法术伤害百分比",3000, "风系狂暴概率",500, "火系法术伤害百分比",3000, "火系狂暴概率",500, "混乱概率",800, "昏睡概率",800, "吸血法术伤害百分比",1000, "震摄法术伤害百分比",500, "鬼火系法术伤害百分比",1000},
	['新手短杖'] = {"物攻",1000, "风系法术伤害百分比",3000, "风系狂暴概率",500, "火系法术伤害百分比",3000, "火系狂暴概率",500, "混乱概率",800, "昏睡概率",800, "吸血法术伤害百分比",1000, "震摄法术伤害百分比",500, "鬼火系法术伤害百分比",1000},
	['新手弓箭'] = {"物攻",1000, "风系法术伤害百分比",3000, "风系狂暴概率",500, "火系法术伤害百分比",3000, "火系狂暴概率",500, "混乱概率",800, "昏睡概率",800, "吸血法术伤害百分比",1000, "震摄法术伤害百分比",500, "鬼火系法术伤害百分比",1000},
	['新手双剑'] = {"物攻",1000, "风系法术伤害百分比",3000, "风系狂暴概率",500, "火系法术伤害百分比",3000, "火系狂暴概率",500, "混乱概率",800, "昏睡概率",800, "吸血法术伤害百分比",1000, "震摄法术伤害百分比",500, "鬼火系法术伤害百分比",1000},
	['新手长鞭'] = {"物攻",1000, "风系法术伤害百分比",3000, "风系狂暴概率",500, "火系法术伤害百分比",3000, "火系狂暴概率",500, "混乱概率",800, "昏睡概率",800, "吸血法术伤害百分比",1000, "震摄法术伤害百分比",500, "鬼火系法术伤害百分比",1000},
	['新手项链'] = {"血量上限",8000, "法力上限",8000, "物理伤害抵抗百分比",3000},
	['新手鞋子'] = {"战斗速度",120},
	['新手白女头盔'] = {"物理伤害抵抗百分比",2000,"混乱抵抗概率",3500},
	['新手白男头盔'] = {"物理伤害抵抗百分比",2000,"混乱抵抗概率",3500},
	['新手白男护甲'] = {"物理伤害抵抗百分比",2000,"物防",100,"混乱抵抗概率",3500},
	['新手白女护甲'] = {"物理伤害抵抗百分比",2000,"物防",100,"混乱抵抗概率",3500},
}

function NoviceEquip.on_item_create(item)
	if NoviceEquip.List then
		local keyName = item:GetKeyName()
		local Tb_Novice = NoviceEquip.List[keyName]
		if Tb_Novice then
			for k,v in ipairs(Tb_Novice) do
				if type(v) == "string" then
					local val = Tb_Novice[k+1]
					if type(val) == "number" then
						local AttrData = AttrConfig.GetByKeyName(v)
						if AttrData then
							local Id = AttrData.Id
							if Id then
								item:SetDynAttr(0, Id, val)
							else
								sLuaApp:LuaDbg("属性 "..v.." 不存在！")
							end
						else
							sLuaApp:LuaDbg("属性 "..v.." 不存在！")
						end
					end
				end
			end
		end
	end
end