--套装配置
SuitConfig = {}
SuitConfig.Main = {
	--别动
	['Sign_STR'] = "equip_suit_keyname",
	--和套装的Suit_KeyName一样，唯一标识，不能填错
	['Suit_1'] = {
		--套装名字，客户端先使用
		['Suit_Name'] = "套装名字1",
		--唯一标识
		['Suit_KeyName'] = "Suit_1",
		--总（最大）件数
		['Total'] = 6,
		--效果配置
		['Size'] = {
			--几件
			[1] = {
				--属性
				['Attr'] = {
					{'物理攻击',2767},
					{'抗强克木',111},
					{'物理攻击',333},
				},
			},
			[2] = {
				['Attr'] = {
					{'抗强克木',4100},
					{'物理攻击',2767},
				},
			},
			[3] = {
				['Attr'] = {
					{'抗强克木',4100},
				},
			},
			[4] = {
				['Attr'] = {
					{'法术吸血',2050},
					{'强克木',4100},
				},
			},
		},
	},
	['Suit_2'] = {
		['Suit_Name'] = "套装名字2",
		['Suit_KeyName'] = "Suit_2",
		['Total'] = 10,
		['Size'] = {
			[1] = {
				['Attr'] = {
					{'物理攻击',2767},
					{'抗强克木',111},
					{'物理攻击',333},
				},
			},
			[2] = {
				['Attr'] = {
					{'抗强克木',4100},
				},
			},
			[3] = {
				['Attr'] = {
					{'法术吸血',4100},
				},
			},
			[4] = {
				['Attr'] = {
					{'木',2050},
					{'普攻吸蓝',4100},
				},
			},
		},
	},
	['新手套装1'] = {
		['Suit_Name'] = "初出茅庐",
		['Suit_KeyName'] = "新手套装1",
		['Total'] = 5,
		['Size'] = {
			[3] = {
				['Attr'] = {
					{'物理攻击',10},
				},
			},
			[4] = {
				['Attr'] = {
					{'物理防御',6},
				},
			},
			[5] = {
				['Attr'] = {
					{'战斗速度',10},
				},
			},
		},
	},
	['新手套装2'] = {
		['Suit_Name'] = "神圣套装",
		['Suit_KeyName'] = "新手套装2",
		['Total'] = 9,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',100},
				},
			},
			[4] = {
				['Attr'] = {
					{'法术攻击',100},
				},
			},
			[9] = {
				['Attr'] = {
					{'战斗速度',100},
				},
			},
		},
	},
	['40级套装1'] = {
		['Suit_Name'] = "神套装",
		['Suit_KeyName'] = "40级套装1",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'命中',220},
				},
			},
			[3] = {
				['Attr'] = {
					{'物理攻击',48},
				},
			},
			[5] = {
				['Attr'] = {
					{'反击',650},
				},
			},
		},
	},
	['40级套装2'] = {
		['Suit_Name'] = "仙套装",
		['Suit_KeyName'] = "40级套装2",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴率',150},
				},
			},
			[3] = {
				['Attr'] = {
					{'法暴伤害',200},
				},
			},
			[5] = {
				['Attr'] = {
					{'法术攻击',48},
				},
			},
		},
	},
	['40级套装3'] = {
		['Suit_Name'] = "圣套装",
		['Suit_KeyName'] = "40级套装3",
		['Total'] = 2,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',24},
				},
			},
		},
	},
	['50级套装1'] = {
		['Suit_Name'] = "驱魔套装",
		['Suit_KeyName'] = "50级套装1",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'命中',270},
				},
			},
			[3] = {
				['Attr'] = {
					{'物理攻击',61},
				},
			},
			[5] = {
				['Attr'] = {
					{'反击',750},
				},
			},
		},
	},
	['50级套装2'] = {
		['Suit_Name'] = "圣佑套装",
		['Suit_KeyName'] = "50级套装2",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理防御',66},
				},
			},
			[3] = {
				['Attr'] = {
					{'法术防御',66},
				},
			},
			[5] = {
				['Attr'] = {
					{'血量上限',358},
				},
			},
		},
	},
	['50级套装3'] = {
		['Suit_Name'] = "仙逆套装",
		['Suit_KeyName'] = "50级套装3",
		['Total'] = 3,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法术攻击',61},
				},
			},
			[3] = {
				['Attr'] = {
					{'法术伤害固定值增加',38},
				},
			},
		},
	},
	['60级套装1'] = {
		['Suit_Name'] = "龙套装",
		['Suit_KeyName'] = "60级套装1",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'命中',330},
				},
			},
			[3] = {
				['Attr'] = {
					{'物理攻击',73},
				},
			},
			[5] = {
				['Attr'] = {
					{'反击',850	},
				},
			},
		},
	},
	['60级套装2'] = {
		['Suit_Name'] = "蛟套装",
		['Suit_KeyName'] = "60级套装2",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理防御',79},
				},
			},
			[3] = {
				['Attr'] = {
					{'法术防御',79},
				},
			},
			[5] = {
				['Attr'] = {
					{'血量上限',432},
				},
			},
		},
	},
	['60级套装3'] = {
		['Suit_Name'] = "鲵套装",
		['Suit_KeyName'] = "60级套装3",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴率',230},
				},
			},
			[3] = {
				['Attr'] = {
					{'法暴伤害',280},
				},
			},
			[5] = {
				['Attr'] = {
					{'法术攻击',73},
				},
			},
		},
	},
	['60级套装4'] = {
		['Suit_Name'] = "魅套装",
		['Suit_KeyName'] = "60级套装4",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',73},
				},
			},
			[3] = {
				['Attr'] = {
					{'封印',200},
				},
			},
			[5] = {
				['Attr'] = {
					{'战斗速度',36},
				},
			},
		},
	},
	['60级套装5'] = {
		['Suit_Name'] = "疾风套装",
		['Suit_KeyName'] = "60级套装5",
		['Total'] = 3,
		['Size'] = {
			[3] = {
				['Attr'] = {
					{'战斗速度',36},
				},
			},
		},
	},
	['70级套装1'] = {
		['Suit_Name'] = "祝融套装",
		['Suit_KeyName'] = "70级套装1",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'命中',380},
				},
			},
			[3] = {
				['Attr'] = {
					{'物理攻击',86},
				},
			},
			[5] = {
				['Attr'] = {
					{'反击',950},
				},
			},
		},
	},
	['70级套装2'] = {
		['Suit_Name'] = "共工套装",
		['Suit_KeyName'] = "70级套装2",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴率',280},
				},
			},
			[3] = {
				['Attr'] = {
					{'法暴伤害',320},
				},
			},
			[5] = {
				['Attr'] = {
					{'法术攻击',86},
				},
			},
		},
	},
	['70级套装3'] = {
		['Suit_Name'] = "女娲套装",
		['Suit_KeyName'] = "70级套装3",
		['Total'] = 2,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',42},
				},
			},
		},
	},
	['70级套装4'] = {
		['Suit_Name'] = "黄帝套装",
		['Suit_KeyName'] = "70级套装4",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',86},
				},
			},
			[3] = {
				['Attr'] = {
					{'封印',300},
				},
			},
			[5] = {
				['Attr'] = {
					{'战斗速度',42},
				},
			},
		},
	},
	['新手套装3'] = {
		['Suit_Name'] = "流光溢彩",
		['Suit_KeyName'] = "新手套装3",
		['Total'] = 3,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理防御',110},
				},
			},
			[3] = {
				['Attr'] = {
					{'物暴率',320},
					{'法暴率',320},
				},
			},
		},
	},
	['战狂'] = {
		['Suit_Name'] = "战狂",
		['Suit_KeyName'] = "战狂",
		['Total'] = 8,
		['Size'] = {
			[3] = {
				['Attr'] = {
					{'物理防御',50},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',150},
					{'法暴率',150},
				},
			},
			[8] = {
				['Attr'] = {
					{'物理攻击',40},
					{'法术攻击',40},
				},
			},
		},
	},
	['战神'] = {
		['Suit_Name'] = "战神",
		['Suit_KeyName'] = "战神",
		['Total'] = 8,
		['Size'] = {
			[3] = {
				['Attr'] = {
					{'物理防御',110},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',400},
					{'法暴率',400},
				},
			},
			[8] = {
				['Attr'] = {
					{'物理攻击',100},
					{'法术攻击',100},
				},
			},
		},
	},
	['战尊'] = {
		['Suit_Name'] = "战尊",
		['Suit_KeyName'] = "战尊",
		['Total'] = 8,
		['Size'] = {
			[3] = {
				['Attr'] = {
					{'物理防御',250},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',900},
					{'法暴率',900},
				},
			},
			[8] = {
				['Attr'] = {
					{'物理攻击',220},
					{'法术攻击',220},
				},
			},
		},
	},
	['80级套装1'] = {
		['Suit_Name'] = "无畏套装",
		['Suit_KeyName'] = "80级套装1",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'命中',470},
				},
			},
			[3] = {
				['Attr'] = {
					{'物理攻击',107},
				},
			},
			[5] = {
				['Attr'] = {
					{'反击',1187},
				},
			},
		},
	},
	['80级套装2'] = {
		['Suit_Name'] = "悍勇套装",
		['Suit_KeyName'] = "80级套装2",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴率',350},
				},
			},
			[3] = {
				['Attr'] = {
					{'法暴伤害',400},
				},
			},
			[5] = {
				['Attr'] = {
					{'法术攻击',107},
				},
			},
		},
	},
	['80级套装3'] = {
		['Suit_Name'] = "稳固套装",
		['Suit_KeyName'] = "80级套装3",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',107},
				},
			},
			[3] = {
				['Attr'] = {
					{'封印',375},
				},
			},
			[5] = {
				['Attr'] = {
					{'战斗速度',52},
				},
			},
		},
	},
	['80级套装4'] = {
		['Suit_Name'] = "不羁套装",
		['Suit_KeyName'] = "80级套装4",
		['Total'] = 2,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',52},
				},
			},
		},
	},
	['90级套装1'] = {
		['Suit_Name'] = "四海套装",
		['Suit_KeyName'] = "90级套装1",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'命中',570},
				},
			},
			[3] = {
				['Attr'] = {
					{'物理攻击',129},
				},
			},
			[5] = {
				['Attr'] = {
					{'反击',1425},
				},
			},
		},
	},
	['90级套装2'] = {
		['Suit_Name'] = "九雷套装",
		['Suit_KeyName'] = "90级套装2",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴率',420},
				},
			},
			[3] = {
				['Attr'] = {
					{'法暴伤害',480},
				},
			},
			[5] = {
				['Attr'] = {
					{'法术攻击',129},
				},
			},
		},
	},
	['90级套装3'] = {
		['Suit_Name'] = "七星套装",
		['Suit_KeyName'] = "90级套装3",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',129},
				},
			},
			[3] = {
				['Attr'] = {
					{'封印',450},
				},
			},
			[5] = {
				['Attr'] = {
					{'战斗速度',63},
				},
			},
		},
	},
	['90级套装4'] = {
		['Suit_Name'] = "两仪套装",
		['Suit_KeyName'] = "90级套装4",
		['Total'] = 2,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',63},
				},
			},
		},
	},
	['100级套装1'] = {
		['Suit_Name'] = "武曲套装",
		['Suit_KeyName'] = "100级套装1",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'命中',660},
				},
			},
			[3] = {
				['Attr'] = {
					{'物理攻击',150},
				},
			},
			[5] = {
				['Attr'] = {
					{'反击',1662},
				},
			},
		},
	},
	['100级套装2'] = {
		['Suit_Name'] = "杀星套装",
		['Suit_KeyName'] = "100级套装2",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴率',490},
				},
			},
			[3] = {
				['Attr'] = {
					{'法暴伤害',560},
				},
			},
			[5] = {
				['Attr'] = {
					{'法术攻击',150},
				},
			},
		},
	},
	['100级套装3'] = {
		['Suit_Name'] = "太阳套装",
		['Suit_KeyName'] = "100级套装3",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',150},
				},
			},
			[3] = {
				['Attr'] = {
					{'封印',525},
				},
			},
			[5] = {
				['Attr'] = {
					{'战斗速度',73},
				},
			},
		},
	},
	['100级套装4'] = {
		['Suit_Name'] = "太阴套装",
		['Suit_KeyName'] = "100级套装4",
		['Total'] = 2,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',73},
				},
			},
		},
	},
	['110级套装1'] = {
		['Suit_Name'] = "逐虎套装",
		['Suit_KeyName'] = "110级套装1",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'命中',760},
				},
			},
			[3] = {
				['Attr'] = {
					{'物理攻击',172},
				},
			},
			[5] = {
				['Attr'] = {
					{'反击',1900},
				},
			},
		},
	},
	['110级套装2'] = {
		['Suit_Name'] = "驱狼套装",
		['Suit_KeyName'] = "110级套装2",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴率',560},
				},
			},
			[3] = {
				['Attr'] = {
					{'法暴伤害',640},
				},
			},
			[5] = {
				['Attr'] = {
					{'法术攻击',172},
				},
			},
		},
	},
	['110级套装3'] = {
		['Suit_Name'] = "御龙套装",
		['Suit_KeyName'] = "110级套装3",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',172},
				},
			},
			[3] = {
				['Attr'] = {
					{'封印',600},
				},
			},
			[5] = {
				['Attr'] = {
					{'战斗速度',84},
				},
			},
		},
	},
	['110级套装4'] = {
		['Suit_Name'] = "落鹏套装",
		['Suit_KeyName'] = "110级套装4",
		['Total'] = 2,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',84},
				},
			},
		},
	},
	['120级套装1'] = {
		['Suit_Name'] = "玉帝套装",
		['Suit_KeyName'] = "120级套装1",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'命中',850},
				},
			},
			[3] = {
				['Attr'] = {
					{'物理攻击',193},
				},
			},
			[4] = {
				['Attr'] = {
					{'反击',2137},
				},
			},
		},
	},
	['120级套装2'] = {
		['Suit_Name'] = "王母套装",
		['Suit_KeyName'] = "120级套装2",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴率',630},
				},
			},
			[3] = {
				['Attr'] = {
					{'法暴伤害',720},
				},
			},
			[4] = {
				['Attr'] = {
					{'法术攻击',193},
				},
			},
		},
	},
	['120级套装3'] = {
		['Suit_Name'] = "太白套装",
		['Suit_KeyName'] = "120级套装3",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',193},
				},
			},
			[3] = {
				['Attr'] = {
					{'封印',675},
				},
			},
			[4] = {
				['Attr'] = {
					{'战斗速度',94},
				},
			},
		},
	},
	['1级打造套装物'] = {
		['Suit_Name'] = "神农·通幽",
		['Suit_KeyName'] = "1级打造套装物",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',50},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',150},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',300},
				},
			},
		},
	},
	['10级打造套装物'] = {
		['Suit_Name'] = "神农·驱神",
		['Suit_KeyName'] = "10级打造套装物",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',60},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',200},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',320},
				},
			},
		},
	},
	['20级打造套装物'] = {
		['Suit_Name'] = "神农·担山",
		['Suit_KeyName'] = "20级打造套装物",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',71},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',250},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',350},
				},
			},
		},
	},
	['30级打造套装物'] = {
		['Suit_Name'] = "神农·禁水",
		['Suit_KeyName'] = "30级打造套装物",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',83},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',310},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',390},
				},
			},
		},
	},
	['40级打造套装物'] = {
		['Suit_Name'] = "神农·借风",
		['Suit_KeyName'] = "40级打造套装物",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',96},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',380},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',440},
				},
			},
		},
	},
	['50级打造套装物'] = {
		['Suit_Name'] = "神农·布雾",
		['Suit_KeyName'] = "50级打造套装物",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',110},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',450},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',500},
				},
			},
		},
	},
	['60级打造套装物'] = {
		['Suit_Name'] = "神农·祈晴",
		['Suit_KeyName'] = "60级打造套装物",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',125},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',530},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',570},
				},
			},
		},
	},
	['70级打造套装物'] = {
		['Suit_Name'] = "神农·祷雨",
		['Suit_KeyName'] = "70级打造套装物",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',141},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',620},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',650},
				},
			},
		},
	},
	['80级打造套装物'] = {
		['Suit_Name'] = "神农·坐火",
		['Suit_KeyName'] = "80级打造套装物",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',158},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',710},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',740},
				},
			},
		},
	},
	['90级打造套装物'] = {
		['Suit_Name'] = "神农·入水",
		['Suit_KeyName'] = "90级打造套装物",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',176},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',810},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',840},
				},
			},
		},
	},
	['100级打造套装物'] = {
		['Suit_Name'] = "神农·掩日",
		['Suit_KeyName'] = "100级打造套装物",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',195},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',920},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',950},
				},
			},
		},
	},
	['110级打造套装物'] = {
		['Suit_Name'] = "神农·御风",
		['Suit_KeyName'] = "110级打造套装物",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',215},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',1050},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',1070},
				},
			},
		},
	},
	['120级打造套装物'] = {
		['Suit_Name'] = "神农·煮石",
		['Suit_KeyName'] = "120级打造套装物",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物理攻击',236},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',1170},
				},
			},
			[5] = {
				['Attr'] = {
					{'物暴率',1200},
				},
			},
		},
	},
	['15级打造套装物'] = {
		['Suit_Name'] = "神农·吐焰",
		['Suit_KeyName'] = "15级打造套装物",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物暴伤害',236},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',117},
					{'封抗',157},
				},
			},
		},
	},
	['25级打造套装物'] = {
		['Suit_Name'] = "神农·吞刀",
		['Suit_KeyName'] = "25级打造套装物",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物暴伤害',110},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',160},
					{'封抗',208},
				},
			},
		},
	},
	['35级打造套装物'] = {
		['Suit_Name'] = "神农·壶天",
		['Suit_KeyName'] = "35级打造套装物",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物暴伤害',133},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',241},
					{'封抗',260},
				},
			},
		},
	},
	['45级打造套装物'] = {
		['Suit_Name'] = "神农·神行",
		['Suit_KeyName'] = "45级打造套装物",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物暴伤害',169},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',353},
					{'封抗',313},
				},
			},
		},
	},
	['55级打造套装物'] = {
		['Suit_Name'] = "神农·履水",
		['Suit_KeyName'] = "55级打造套装物",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物暴伤害',218},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',496},
					{'封抗',367},
				},
			},
		},
	},
	['65级打造套装物'] = {
		['Suit_Name'] = "神农·杖解",
		['Suit_KeyName'] = "65级打造套装物",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物暴伤害',280},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',670},
					{'封抗',422},
				},
			},
		},
	},
	['75级打造套装物'] = {
		['Suit_Name'] = "神农·分身",
		['Suit_KeyName'] = "75级打造套装物",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物暴伤害',355},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',875},
					{'封抗',478},
				},
			},
		},
	},
	['85级打造套装物'] = {
		['Suit_Name'] = "神农·隐识",
		['Suit_KeyName'] = "85级打造套装物",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物暴伤害',443},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',1111},
					{'封抗',535},
				},
			},
		},
	},
	['95级打造套装物'] = {
		['Suit_Name'] = "神农·复生",
		['Suit_KeyName'] = "95级打造套装物",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物暴伤害',544},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',1378},
					{'封抗',593},
				},
			},
		},
	},
	['105级打造套装物'] = {
		['Suit_Name'] = "神农·定身",
		['Suit_KeyName'] = "105级打造套装物",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物暴伤害',658},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',1676},
					{'封抗',652},
				},
			},
		},
	},
	['115级打造套装物'] = {
		['Suit_Name'] = "神农·斩妖",
		['Suit_KeyName'] = "115级打造套装物",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'物暴伤害',785},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',2005},
					{'封抗',712},
				},
			},
		},
	},
	['1级打造套装法'] = {
		['Suit_Name'] = "轩辕·请仙",
		['Suit_KeyName'] = "1级打造套装法",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法术攻击',50},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',150},
				},
			},
			[5] = {
				['Attr'] = {
					{'法暴率',300},
				},
			},
		},
	},
	['10级打造套装法'] = {
		['Suit_Name'] = "轩辕·追魂",
		['Suit_KeyName'] = "10级打造套装法",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法术攻击',60},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',200},
				},
			},
			[5] = {
				['Attr'] = {
					{'法暴率',320},
				},
			},
		},
	},
	['20级打造套装法'] = {
		['Suit_Name'] = "轩辕·摄魂",
		['Suit_KeyName'] = "20级打造套装法",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法术攻击',71},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',250},
				},
			},
			[5] = {
				['Attr'] = {
					{'法暴率',350},
				},
			},
		},
	},
	['30级打造套装法'] = {
		['Suit_Name'] = "轩辕·招云",
		['Suit_KeyName'] = "30级打造套装法",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法术攻击',83},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',310},
				},
			},
			[5] = {
				['Attr'] = {
					{'法暴率',390},
				},
			},
		},
	},
	['40级打造套装法'] = {
		['Suit_Name'] = "轩辕·取月",
		['Suit_KeyName'] = "40级打造套装法",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法术攻击',96},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',380},
				},
			},
			[5] = {
				['Attr'] = {
					{'法暴率',440},
				},
			},
		},
	},
	['50级打造套装法'] = {
		['Suit_Name'] = "轩辕·移山",
		['Suit_KeyName'] = "50级打造套装法",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法术攻击',110},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',450},
				},
			},
			[5] = {
				['Attr'] = {
					{'法暴率',500},
				},
			},
		},
	},
	['60级打造套装法'] = {
		['Suit_Name'] = "轩辕·嫁梦",
		['Suit_KeyName'] = "60级打造套装法",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法术攻击',125},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',530},
				},
			},
			[5] = {
				['Attr'] = {
					{'法暴率',570},
				},
			},
		},
	},
	['70级打造套装法'] = {
		['Suit_Name'] = "轩辕·支离",
		['Suit_KeyName'] = "70级打造套装法",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法术攻击',141},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',620},
				},
			},
			[5] = {
				['Attr'] = {
					{'法暴率',650},
				},
			},
		},
	},
	['80级打造套装法'] = {
		['Suit_Name'] = "轩辕·接木",
		['Suit_KeyName'] = "80级打造套装法",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法术攻击',158},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',710},
				},
			},
			[5] = {
				['Attr'] = {
					{'法暴率',740},
				},
			},
		},
	},
	['90级打造套装法'] = {
		['Suit_Name'] = "轩辕·断流",
		['Suit_KeyName'] = "90级打造套装法",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法术攻击',176},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',810},
				},
			},
			[5] = {
				['Attr'] = {
					{'法暴率',840},
				},
			},
		},
	},
	['100级打造套装法'] = {
		['Suit_Name'] = "轩辕·禳灾",
		['Suit_KeyName'] = "100级打造套装法",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法术攻击',195},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',920},
				},
			},
			[5] = {
				['Attr'] = {
					{'法暴率',950},
				},
			},
		},
	},
	['110级打造套装法'] = {
		['Suit_Name'] = "轩辕·解厄",
		['Suit_KeyName'] = "110级打造套装法",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法术攻击',215},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',1040},
				},
			},
			[5] = {
				['Attr'] = {
					{'法暴率',1070},
				},
			},
		},
	},
	['120级打造套装法'] = {
		['Suit_Name'] = "轩辕·黄白",
		['Suit_KeyName'] = "120级打造套装法",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法术攻击',236},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',1170},
				},
			},
			[5] = {
				['Attr'] = {
					{'法暴率',1200},
				},
			},
		},
	},
	['15级打造套装法'] = {
		['Suit_Name'] = "轩辕·剑术",
		['Suit_KeyName'] = "15级打造套装法",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴伤害',100},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',110},
					{'封抗',157},
				},
			},
		},
	},
	['25级打造套装法'] = {
		['Suit_Name'] = "轩辕·射覆",
		['Suit_KeyName'] = "25级打造套装法",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴伤害',110},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',160},
					{'封抗',208},
				},
			},
		},
	},
	['35级打造套装法'] = {
		['Suit_Name'] = "轩辕·土行",
		['Suit_KeyName'] = "35级打造套装法",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴伤害',133},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',241},
					{'封抗',260},
				},
			},
		},
	},
	['45级打造套装法'] = {
		['Suit_Name'] = "轩辕·星术",
		['Suit_KeyName'] = "45级打造套装法",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴伤害',169},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',353},
					{'封抗',313},
				},
			},
		},
	},
	['55级打造套装法'] = {
		['Suit_Name'] = "轩辕·布阵",
		['Suit_KeyName'] = "55级打造套装法",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴伤害',218},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',496},
					{'封抗',367},
				},
			},
		},
	},
	['65级打造套装法'] = {
		['Suit_Name'] = "轩辕·假形",
		['Suit_KeyName'] = "65级打造套装法",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴伤害',280},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',670},
					{'封抗',422},
				},
			},
		},
	},
	['75级打造套装法'] = {
		['Suit_Name'] = "轩辕·喷化",
		['Suit_KeyName'] = "75级打造套装法",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴伤害',355},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',875},
					{'封抗',478},
				},
			},
		},
	},
	['85级打造套装法'] = {
		['Suit_Name'] = "轩辕·指化",
		['Suit_KeyName'] = "85级打造套装法",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴伤害',443},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',1111},
					{'封抗',535},
				},
			},
		},
	},
	['95级打造套装法'] = {
		['Suit_Name'] = "轩辕·尸解",
		['Suit_KeyName'] = "95级打造套装法",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴伤害',544},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',1378},
					{'封抗',593},
				},
			},
		},
	},
	['105级打造套装法'] = {
		['Suit_Name'] = "轩辕·移景",
		['Suit_KeyName'] = "105级打造套装法",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴伤害',658},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',1676},
					{'封抗',652},
				},
			},
		},
	},
	['115级打造套装法'] = {
		['Suit_Name'] = "轩辕·招来",
		['Suit_KeyName'] = "115级打造套装法",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'法暴伤害',785},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',2005},
					{'封抗',712},
				},
			},
		},
	},
	['1级打造套装封'] = {
		['Suit_Name'] = "蚩尤·迹云",
		['Suit_KeyName'] = "1级打造套装封",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'封印',97},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',150},
				},
			},
			[5] = {
				['Attr'] = {
					{'物理攻击',50},
				},
			},
		},
	},
	['10级打造套装封'] = {
		['Suit_Name'] = "蚩尤·聚兽",
		['Suit_KeyName'] = "10级打造套装封",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'封印',147},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',200},
				},
			},
			[5] = {
				['Attr'] = {
					{'物理攻击',60},
				},
			},
		},
	},
	['20级打造套装封'] = {
		['Suit_Name'] = "蚩尤·御禽",
		['Suit_KeyName'] = "20级打造套装封",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'封印',198},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',250},
				},
			},
			[5] = {
				['Attr'] = {
					{'物理攻击',71},
				},
			},
		},
	},
	['30级打造套装封'] = {
		['Suit_Name'] = "蚩尤·气禁",
		['Suit_KeyName'] = "30级打造套装封",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'封印',250},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',310},
				},
			},
			[5] = {
				['Attr'] = {
					{'物理攻击',83},
				},
			},
		},
	},
	['40级打造套装封'] = {
		['Suit_Name'] = "蚩尤·蛮力",
		['Suit_KeyName'] = "40级打造套装封",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'封印',303},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',380},
				},
			},
			[5] = {
				['Attr'] = {
					{'物理攻击',96},
				},
			},
		},
	},
	['50级打造套装封'] = {
		['Suit_Name'] = "蚩尤·透石",
		['Suit_KeyName'] = "50级打造套装封",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'封印',357},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',450},
				},
			},
			[5] = {
				['Attr'] = {
					{'物理攻击',110},
				},
			},
		},
	},
	['60级打造套装封'] = {
		['Suit_Name'] = "蚩尤·生光",
		['Suit_KeyName'] = "60级打造套装封",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'封印',412},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',530},
				},
			},
			[5] = {
				['Attr'] = {
					{'物理攻击',125},
				},
			},
		},
	},
	['70级打造套装封'] = {
		['Suit_Name'] = "蚩尤·障服",
		['Suit_KeyName'] = "70级打造套装封",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'封印',468},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',620},
				},
			},
			[5] = {
				['Attr'] = {
					{'物理攻击',141},
				},
			},
		},
	},
	['80级打造套装封'] = {
		['Suit_Name'] = "蚩尤·导引",
		['Suit_KeyName'] = "80级打造套装封",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'封印',525},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',710},
				},
			},
			[5] = {
				['Attr'] = {
					{'物理攻击',158},
				},
			},
		},
	},
	['90级打造套装封'] = {
		['Suit_Name'] = "蚩尤·吞噬",
		['Suit_KeyName'] = "90级打造套装封",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'封印',583},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',810},
				},
			},
			[5] = {
				['Attr'] = {
					{'物理攻击',176},
				},
			},
		},
	},
	['100级打造套装封'] = {
		['Suit_Name'] = "蚩尤·开避",
		['Suit_KeyName'] = "100级打造套装封",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'封印',642},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',920},
				},
			},
			[5] = {
				['Attr'] = {
					{'物理攻击',195},
				},
			},
		},
	},
	['110级打造套装封'] = {
		['Suit_Name'] = "蚩尤·跃岩",
		['Suit_KeyName'] = "110级打造套装封",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'封印',702},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',1040},
				},
			},
			[5] = {
				['Attr'] = {
					{'物理攻击',215},
				},
			},
		},
	},
	['120级打造套装封'] = {
		['Suit_Name'] = "蚩尤·预感",
		['Suit_KeyName'] = "120级打造套装封",
		['Total'] = 5,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'封印',763},
				},
			},
			[4] = {
				['Attr'] = {
					{'命中',1170},
				},
			},
			[5] = {
				['Attr'] = {
					{'物理攻击',236},
				},
			},
		},
	},
	['15级打造套装封'] = {
		['Suit_Name'] = "蚩尤·登抄",
		['Suit_KeyName'] = "15级打造套装封",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',20},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',110},
					{'封抗',157},
				},
			},
		},
	},
	['25级打造套装封'] = {
		['Suit_Name'] = "蚩尤·摄水",
		['Suit_KeyName'] = "25级打造套装封",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',20},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',160},
					{'封抗',208},
				},
			},
		},
	},
	['35级打造套装封'] = {
		['Suit_Name'] = "蚩尤·卧雪",
		['Suit_KeyName'] = "35级打造套装封",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',20},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',241},
					{'封抗',260},
				},
			},
		},
	},
	['45级打造套装封'] = {
		['Suit_Name'] = "蚩尤·御日",
		['Suit_KeyName'] = "45级打造套装封",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',20},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',353},
					{'封抗',313},
				},
			},
		},
	},
	['55级打造套装封'] = {
		['Suit_Name'] = "蚩尤·弄丸",
		['Suit_KeyName'] = "55级打造套装封",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',20},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',496},
					{'封抗',367},
				},
			},
		},
	},
	['65级打造套装封'] = {
		['Suit_Name'] = "蚩尤·符水",
		['Suit_KeyName'] = "65级打造套装封",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',20},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',670},
					{'封抗',422},
				},
			},
		},
	},
	['75级打造套装封'] = {
		['Suit_Name'] = "蚩尤·驱邪",
		['Suit_KeyName'] = "75级打造套装封",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',20},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',875},
					{'封抗',478},
				},
			},
		},
	},
	['85级打造套装封'] = {
		['Suit_Name'] = "蚩尤·知时",
		['Suit_KeyName'] = "85级打造套装封",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',20},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',1111},
					{'封抗',535},
				},
			},
		},
	},
	['95级打造套装封'] = {
		['Suit_Name'] = "蚩尤·识地",
		['Suit_KeyName'] = "95级打造套装封",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',20},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',1378},
					{'封抗',593},
				},
			},
		},
	},
	['105级打造套装封'] = {
		['Suit_Name'] = "蚩尤·辟谷",
		['Suit_KeyName'] = "105级打造套装封",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',20},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',1676},
					{'封抗',652},
				},
			},
		},
	},
	['115级打造套装封'] = {
		['Suit_Name'] = "蚩尤·魇祷",
		['Suit_KeyName'] = "115级打造套装封",
		['Total'] = 4,
		['Size'] = {
			[2] = {
				['Attr'] = {
					{'战斗速度',20},
				},
			},
			[4] = {
				['Attr'] = {
					{'血量上限',2005},
					{'封抗',712},
				},
			},
		},
	},
}
SuitConfig.EquipSuitRadomConfig = {
	['Level_30'] = {
			{suit_keyname = "Suit_1",Rand = 500},
			{suit_keyname = "Suit_2",Rand = 500},
	},
	['All'] = {
			{suit_keyname = "Suit_1",Rand = 500},
			{suit_keyname = "Suit_2",Rand = 500},
	},
}

SuitConfig.ChangeByItem = {
	['神农·通幽套装符'] = {suit_keyname="1级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['神农·驱神套装符'] = {suit_keyname="10级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['神农·担山套装符'] = {suit_keyname="20级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['神农·禁水套装符'] = {suit_keyname="30级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['神农·借风套装符'] = {suit_keyname="40级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['神农·布雾套装符'] = {suit_keyname="50级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['神农·祈晴套装符'] = {suit_keyname="60级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['神农·祷雨套装符'] = {suit_keyname="70级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['神农·坐火套装符'] = {suit_keyname="80级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['神农·入水套装符'] = {suit_keyname="90级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['神农·掩日套装符'] = {suit_keyname="100级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['神农·御风套装符'] = {suit_keyname="110级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['神农·煮石套装符'] = {suit_keyname="120级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['神农·吐焰套装符'] = {suit_keyname="15级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['神农·吞刀套装符'] = {suit_keyname="25级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['神农·壶天套装符'] = {suit_keyname="35级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['神农·神行套装符'] = {suit_keyname="45级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['神农·履水套装符'] = {suit_keyname="55级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['神农·杖解套装符'] = {suit_keyname="65级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['神农·分身套装符'] = {suit_keyname="75级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['神农·隐识套装符'] = {suit_keyname="85级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['神农·复生套装符'] = {suit_keyname="95级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['神农·定身套装符'] = {suit_keyname="105级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['神农·斩妖套装符'] = {suit_keyname="115级打造套装物",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['轩辕·请仙套装符'] = {suit_keyname="1级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['轩辕·追魂套装符'] = {suit_keyname="10级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['轩辕·摄魂套装符'] = {suit_keyname="20级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['轩辕·招云套装符'] = {suit_keyname="30级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['轩辕·取月套装符'] = {suit_keyname="40级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['轩辕·移山套装符'] = {suit_keyname="50级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['轩辕·嫁梦套装符'] = {suit_keyname="60级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['轩辕·支离套装符'] = {suit_keyname="70级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['轩辕·接木套装符'] = {suit_keyname="80级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['轩辕·断流套装符'] = {suit_keyname="90级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['轩辕·禳灾套装符'] = {suit_keyname="100级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['轩辕·解厄套装符'] = {suit_keyname="110级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['轩辕·黄白套装符'] = {suit_keyname="120级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['轩辕·剑术套装符'] = {suit_keyname="15级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['轩辕·射覆套装符'] = {suit_keyname="25级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['轩辕·土行套装符'] = {suit_keyname="35级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['轩辕·星术套装符'] = {suit_keyname="45级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['轩辕·布阵套装符'] = {suit_keyname="55级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['轩辕·假形套装符'] = {suit_keyname="65级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['轩辕·喷化套装符'] = {suit_keyname="75级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['轩辕·指化套装符'] = {suit_keyname="85级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['轩辕·尸解套装符'] = {suit_keyname="95级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['轩辕·移景套装符'] = {suit_keyname="105级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['轩辕·招来套装符'] = {suit_keyname="115级打造套装法",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['蚩尤·迹云套装符'] = {suit_keyname="1级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['蚩尤·聚兽套装符'] = {suit_keyname="10级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['蚩尤·御禽套装符'] = {suit_keyname="20级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['蚩尤·气禁套装符'] = {suit_keyname="30级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['蚩尤·蛮力套装符'] = {suit_keyname="40级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['蚩尤·透石套装符'] = {suit_keyname="50级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['蚩尤·生光套装符'] = {suit_keyname="60级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['蚩尤·障服套装符'] = {suit_keyname="70级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['蚩尤·导引套装符'] = {suit_keyname="80级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['蚩尤·吞噬套装符'] = {suit_keyname="90级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['蚩尤·开避套装符'] = {suit_keyname="100级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['蚩尤·跃岩套装符'] = {suit_keyname="110级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['蚩尤·预感套装符'] = {suit_keyname="120级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=1,sub_type_2=1,sub_type_3=0},
	['蚩尤·登抄套装符'] = {suit_keyname="15级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['蚩尤·摄水套装符'] = {suit_keyname="25级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['蚩尤·卧雪套装符'] = {suit_keyname="35级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['蚩尤·御日套装符'] = {suit_keyname="45级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['蚩尤·弄丸套装符'] = {suit_keyname="55级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['蚩尤·符水套装符'] = {suit_keyname="65级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['蚩尤·驱邪套装符'] = {suit_keyname="75级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['蚩尤·知时套装符'] = {suit_keyname="85级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['蚩尤·识地套装符'] = {suit_keyname="95级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['蚩尤·辟谷套装符'] = {suit_keyname="105级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
	['蚩尤·魇祷套装符'] = {suit_keyname="115级打造套装封",money_type=5,money_value=100000,change_rate=10000,sub_type_1=0,sub_type_2=0,sub_type_3=1},
}