--区域任务配置
RegionTaskConfig = {}


--每日参与次数
RegionTaskConfig.Join_Max = 100

--活动界面 展示奖励 物品id
RegionTaskConfig.ShowItem = "61025,61024,20168,61022,31402"


--每天刷新时间（时：分：秒）
RegionTaskConfig.RefreshTime = {
    "00:30:00",
    "01:30:01",
    "02:30:02",
    "03:30:03",
    "04:30:04",
    "05:30:05",
    "06:30:06",
    "07:30:07",
    "08:30:08",
    "09:30:09",
    "10:30:10",
    "11:30:11",
    "12:30:12",
    "13:30:13",
    "14:30:14",
    "15:30:15",
    "16:30:16",
    "17:30:17",
    "18:30:18",
    "19:30:19",
    "20:30:20",
    "21:30:21",
    "22:30:22",
    "23:30:23",
}

--先确定刷新地图，再确定每个地图的任务数量，最后确定任务类型，最最后根据任务类型随机刷
--任务配置中对应的地图坐标需要尽量多于地图任务数量
RegionTaskConfig.RefreshMapNum = 4
RegionTaskConfig.RefreshMap = {
    {Map = "长安城", TaskNum = {3,3}},
    {Map = "江南野外", TaskNum = {2,2}},
    {Map = "东海海湾", TaskNum = {2,2}},
    {Map = "大唐国境", TaskNum = {2,2}},
    {Map = "大唐境外", TaskNum = {1,1}},
    {Map = "玄阴池", TaskNum = {1,1}},
    {Map = "解阳山", TaskNum = {1,1}},
}






RegionTaskConfig.TaskRandom = {
    {Name = "护送", Rand = 100},
    {Name = "寻物", Rand = 100},
    {Name = "讨伐", Rand = 100},
}

--前几次打开界面显示提示
RegionTaskConfig.ShowTipTimes = 3

--护送任务配置
RegionTaskConfig.Escort = {
    --详细界面中提示
    Tips = "与其他义士一同护送目标前行，击退来犯的恶人！<color=#FF0000FF>（贴身护送和击退恶人都会增加参与度，护送目标到达终点后，根据参与度获得相应的感谢邮件）</color>",
    --完成任务后NPC停留时间
    FinishRemainTime = 60,
    --完成任务在简要界面的提示
    FinishBriefInfo = "护送已完成，已根据您的参与度$Integral$获得感谢邮件",

    EscortRefresh = {
        ["长安城"] = {
            {   
                NPCKeyName = "朝廷使者",
                StartPoint = {139, 90, 20},
                EscortPoint = {
                    {276, 176, 20},
                    {373, 218, 5},
                    {600, 80, 5},
                    {612, 26, 5},
                },
                MoveSpeed = 110,
                --存在时长
                Duration = 10*60,
                --检测时间间隔
                CheckInterval = 2,
                --检测距离
                CheckRange = 20,
                --每次检测加分
                AddIntegral = 1,
                --护送限时
                LimitTime = 10*60,
                --刷怪规则1：怪物根据进度刷新
                RefreshMonsterProgress = {
                    {10,35},{40,65},{70,95},
                },
                --刷怪规则2：时间间隔刷怪
                RefreshMonsterInterval = 0,
                --刷怪规则2：怪物最多刷新次数
                RefreshMonsterNum = 0,
                --怪物列表
                MonsterConfig = {
                    {NPCKeyName = "主谋", MonID = 6261},
            
                },
                MonsterIntegral = {
                    --战斗胜利后所有参与者加分
                    ["All"] = 1,
                    --战斗胜利后胜利队伍额外加分
                    ["Winner"] = 30, 
                    
                }, 

                Info = {
                    --任务名
                    TaskTitle = "帝都迷雾",
                    --简要任务介绍
                    BriefInfo = "护送宫廷文物安全离开长安城，解开王都阴谋",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "长安城，帝国的都城，然而城中风云变幻，一场神秘的阴谋笼罩在城市上空。朝廷派遣少侠护送珍贵的宫廷文物离开长安，同时调查并揭露这些阴谋。",
                        [2] = "在城内的阴暗巷陌和古老宫殿中，少侠将与各种势力进行斗争，确保文物的安全。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "谁能挺身而出，护送文物安全离开长安？",
                        --进行中npc聊天气泡，分阶段
                        [2] = {
                            [1] = "小心！有人在暗中窥视我们！",
                            [2] = "叛徒出现了，快来支援！",
                        },
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "你愿意承担这个重任吗？护送文物是我们的当务之急，同时也需要揭开这些阴谋，维护帝国的安全！",
                        --进行中npc对话，分阶段
                        [2] = {
                            [1] = "少侠，我们的任务不仅仅是护送文物，更重要的是保护帝国的安全，我们必须警惕周围的一切。",
                            [2] = "这是一场阴谋，我们必须小心，保护好文物，维护帝国的尊严！",
                        },
                    },
                    -- 主谋喊话：“你们不能阻止我的计划，一切都将按照我的意愿发展！”
                    -- 主谋对话：“哈哈哈，你们是不是以为你们可以阻止我？你们只是弱小的蝼蚁！”
                    --发件人 ""表示被护送的NPC名字
                    MailSendName = "朝廷使者",
                    --邮件标题
                    MailTitle = "文物平安抵达",
                    --邮件内容
                    MailContent = "尊敬的少侠，你的勇气和智慧帮助我们完成了这个艰巨的任务，文物平安抵达。作为对你的奖励，我们特此奉上一份丰厚的奖励，同时也感谢你为帝国的安全所做出的贡献。朝廷使者敬上。",
                    --护送超时提示
                    TimeOutMsg = "您护送的文物已被叛徒夺取，此乃大唐之哀",
                },
            },
            {   
                NPCKeyName = "寻宝队队长",
                StartPoint = {592, 342, 5},
                EscortPoint = {
                    {419, 243, 20},
                    {319, 138, 20},
                    {389, 61, 20},
                },
                MoveSpeed = 110,
                --存在时长
                Duration = 10*60,
                --检测时间间隔
                CheckInterval = 2,
                --检测距离
                CheckRange = 20,
                --每次检测加分
                AddIntegral = 1,
                --护送限时
                LimitTime = 10*60,
                --刷怪规则1：怪物根据进度刷新
                RefreshMonsterProgress = {
                    {10,35},{40,65},{70,95},
                },
                --刷怪规则2：时间间隔刷怪
                RefreshMonsterInterval = 0,
                --刷怪规则2：怪物最多刷新次数
                RefreshMonsterNum = 0,
                --怪物列表
                MonsterConfig = {
                    {NPCKeyName = "纨绔贵族手下", MonID = 6262},
            
                },
                MonsterIntegral = {
                    --战斗胜利后所有参与者加分
                    ["All"] = 1,
                    --战斗胜利后胜利队伍额外加分
                    ["Winner"] = 30, 
                    
                }, 

                Info = {
                    --任务名
                    TaskTitle = "寻宝之旅",
                    --简要任务介绍
                    BriefInfo = "护送寻宝队安全抵达大雁塔。",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "大雁塔，座落于长安城中，内藏无数珍宝和传奇。一支寻宝队计划前往大雁塔探索，但路途充满了各种隐患。",
                        [2] = "富有的纨绔贵族得知此事，派出手下阻挠寻宝队前行，企图掌控寻宝队的动向。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "听闻你是名勇猛的少侠，愿意帮助我们护送前往大雁塔的寻宝队伍吗？",
                        --进行中npc聊天气泡，分阶段
                        [2] = {
                            [1] = "小心！有人在暗中窥视我们！",
                            [2] = "附近有纨绔贵族的手下，我们必须小心应对！",
                        },
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "少侠，我们计划从长安城门出发，前往大雁塔寻宝，但路途危机重重，需要你的帮助护送。",
                        --进行中npc对话，分阶段
                        [2] = {
                            [1] = "少侠，感谢你的护送，我们即将抵达大雁塔。",
                            [2] = "我们需要尽快脱离这里！",
                        },
                    },
                    --纨绔贵族手下喊话：“快！我们不能让他们顺利通过！”
                    --纨绔贵族手下喊话：“快看，那不是我们的目标吗？抓住他们！”
                    --发件人 ""表示被护送的NPC名字
                    MailSendName = "寻宝队队长",
                    --邮件标题
                    MailTitle = "大雁塔护送",
                    --邮件内容
                    MailContent = "尊敬的少侠，感谢你的护送，让我们安全抵达了大雁塔。作为感谢，特此奉上一份寻宝队的礼物，请收下。",
                    --护送超时提示
                    TimeOutMsg = "您护送的寻宝队伍已被歹人掳走，下落不明",
                },
            },
        },
        ["江南野外"] = {  
            {   
                NPCKeyName = "药谷草药商",
                StartPoint = {150, 202, 10},
                EscortPoint = {
                    {51, 132, 5},
                    {131, 99, 5},
                    {47, 86, 10},
                    {93, 85, 1},
                },
                MoveSpeed = 110,
                --存在时长
                Duration = 10*60,
                --检测时间间隔
                CheckInterval = 2,
                --检测距离
                CheckRange = 20,
                --每次检测加分
                AddIntegral = 1,
                --护送限时
                LimitTime = 10*60,
                --刷怪规则1：怪物根据进度刷新
                RefreshMonsterProgress = {
                    {10,35},{40,65},{70,95},
                },
                --刷怪规则2：时间间隔刷怪
                RefreshMonsterInterval = 0,
                --刷怪规则2：怪物最多刷新次数
                RefreshMonsterNum = 0,
                --怪物列表
                MonsterConfig = {
                    {NPCKeyName = "劫匪头领", MonID = 6263},
            
                },
                MonsterIntegral = {
                    --战斗胜利后所有参与者加分
                    ["All"] = 1,
                    --战斗胜利后胜利队伍额外加分
                    ["Winner"] = 30, 
                    
                }, 

                Info = {
                    --任务名
                    TaskTitle = "药谷护送",
                    --简要任务介绍
                    BriefInfo = "护送草药商前往江南野外的药谷，采集珍稀草药",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "江南野外风景秀美，其间的草药隐藏着诸多秘密。草药商委托少侠护送他前往药谷，采集珍贵的草药。",
                        [2] = "这里充满了各种危险，少侠需要小心应对，保护好草药商，并顺利将其护送到目的地。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "听说你是个勇敢的少侠，是否护送我前往药谷？",
                        --进行中npc聊天气泡，分阶段
                        [2] = {
                            [1] = "前方就是药谷，我们快点赶路吧！",
                            [2] = "小心！有人来抢劫了！",
                        },
                        [3] = "多亏了你，我们终于平安抵达了。谢谢你，少侠！",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "少侠啊，这次我要前往药谷采集珍贵的草药，但这里充满了危险，你是否能助我一臂之力，保证我安全抵达目的地？",
                        --进行中npc对话，分阶段
                        [2] = {
                            [1] = "少侠，请小心周围的野兽和陷阱。",
                            [2] = "少侠，我们必须保护好这批草药，不能让他们得逞！",
                        },
                        [3] = "多亏了你，我们终于平安抵达了。谢谢你，少侠！",
                    },
                    -- 劫匪喊话：“哈哈，给我把草药交出来！”
                    -- 劫匪对话：“别想从我们这里带走草药！”
                    --发件人 ""表示被护送的NPC名字  --客户端不显示
                    MailSendName = "药谷草药商",
                    --邮件标题
                    MailTitle = "药谷护送",
                    --邮件内容
                    MailContent = "尊敬的少侠，感谢你顺利护送我前往药谷。这批草药将会为许多人带来康复和健康，你的帮助至关重要，我特此奉上一份奖励。希望你能继续保护草药的安全，为药谷贡献更多力量！药谷草药商敬上。",
                    --护送超时提示
                    TimeOutMsg = "您护送的草药商遭遇打劫，已倾家荡产",
                },
            },
            {   
                NPCKeyName = "江南隐士",
                StartPoint = {161, 94, 10},
                EscortPoint = {
                    {54, 140, 5},
                    {8, 117, 1},
                    {18, 87, 1},
                },
                MoveSpeed = 110,
                --存在时长
                Duration = 10*60,
                --检测时间间隔
                CheckInterval = 2,
                --检测距离
                CheckRange = 20,
                --每次检测加分
                AddIntegral = 1,
                --护送限时
                LimitTime = 10*60,
                --刷怪规则1：怪物根据进度刷新
                RefreshMonsterProgress = {
                    {10,35},{40,65},{70,95},
                },
                --刷怪规则2：时间间隔刷怪
                RefreshMonsterInterval = 0,
                --刷怪规则2：怪物最多刷新次数
                RefreshMonsterNum = 0,
                MonsterConfig = {
                    {NPCKeyName = "幻兽", MonID = 6264},
            
                },
                MonsterIntegral = {
                    --战斗胜利后所有参与者加分
                    ["All"] = 1,
                    --战斗胜利后胜利队伍额外加分
                    ["Winner"] = 30, 
                    
                }, 

                Info = {
                    --任务名
                    TaskTitle = "山野求道",
                    --简要任务介绍
                    BriefInfo = "在山野中寻找修行之道",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "这里山野幽静，藏匿着修行的奥秘。少侠听闻山间有一位隐士，据说擅长修炼灵气之术，决定前往拜访",
                        [2] = "在山林幽径和清泉溪谷中，少侠将与自然融合，感悟修行之道，寻找心灵的归宿。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "寻找修行之道的人啊，你愿意与我一同探索山野吗？",
                        --进行中npc聊天气泡，分阶段
                        [2] = {
                            [1] = "自然气息与你心灵相通，你能感受到吗？",
                            [2] = "山林之间的幻兽出现了，小心啊！",
                        },
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "年轻人，你内心是否渴望得到启迪？山野中隐藏着你寻找的答案。",
                        --进行中npc对话，分阶段
                        [2] = {
                            [1] = "少侠，每一步都是修行的一部分，让我们一起融入自然，感悟心灵的宁静吧！",
                            [2] = "这是此处的守护者，我们必须小心应对，以免惹恼它们！",
                        },
                    },
                    -- 幻兽喊话： "这里是我的领地，你们不得侵犯！"
                    -- 幻兽对话： "人类啊，你们无法理解山野之间的规则，现在离开还来得及！"
                    --发件人 ""表示被护送的NPC名字  --客户端不显示
                    MailSendName = "江南隐士",
                    --邮件标题
                    MailTitle = "山野修行",
                    --邮件内容
                    MailContent = "尊敬的修行者，感谢你在野外所做出的探索和修行，你的勇气和智慧将永远被铭记在我的心中，这是你的奖励。希望你能继续在修行之道上精进！江南隐士敬上。",
                    --护送超时提示
                    TimeOutMsg = "您陪同的隐士已游历去别处",
                },
            },
        },
        ["东海海湾"] = {  
            {   
                NPCKeyName = "村民",
                StartPoint = {155, 128, 10},
                EscortPoint = {
                    {133, 55, 10},
                    {120, 15, 5},
                    {65, 43, 10},
                },
                MoveSpeed = 110,
                --存在时长
                Duration = 10*60,
                --检测时间间隔
                CheckInterval = 2,
                --检测距离
                CheckRange = 20,
                --每次检测加分
                AddIntegral = 1,
                --护送限时
                LimitTime = 10*60,
                --刷怪规则1：怪物根据进度刷新
                RefreshMonsterProgress = {
                    {10,35},{40,65},{70,95},
                },
                --刷怪规则2：时间间隔刷怪
                RefreshMonsterInterval = 0,
                --刷怪规则2：怪物最多刷新次数
                RefreshMonsterNum = 0,
                --怪物列表
                MonsterConfig = {
                    {NPCKeyName = "海妖", MonID = 6265},
            
                },
                MonsterIntegral = {
                    --战斗胜利后所有参与者加分
                    ["All"] = 1,
                    --战斗胜利后胜利队伍额外加分
                    ["Winner"] = 30, 
                    
                }, 

                Info = {
                    --任务名
                    TaskTitle = "潮湿的困境",
                    --简要任务介绍
                    BriefInfo = "护送渔民穿越危险的海妖领地",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "小渔村的渔民们因为海妖的出现而感到恐慌，他们亟需离开这里。你受到村民的委托，护送他们离开海妖领地，前往安全的地方。",
                        [2] = "保护渔民免受海妖的袭击，解开海妖的诅咒，确保他们平安抵达目的地。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "少侠，我们需要你的帮助！请护送我们离开这片危险的海岸。",
                        --进行中npc聊天气泡，分阶段
                        [2] = {
                            [1] = "小心！海妖要来了！",
                            [2] = "海妖出现了！快来支援！",
                        },
                        [3] = "多亏了你，我们终于平安抵达了。谢谢你，少侠！",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "有谁能听见吗？我们需要离开这里，海妖会出现的！",
                        --进行中npc对话，分阶段
                        [2] = {
                            [1] = "少侠，我们需要你的保护！请带领我们尽快离开这里！",
                            [2] = "我们的生命就靠你了！请抵挡住海妖的攻击！",
                        },
                        [3] = "多亏了你，我们终于平安抵达了。谢谢你，少侠！",
                    },
                    --发件人 ""表示被护送的NPC名字  --客户端不显示
                    MailSendName = "村民代表",
                    --邮件标题
                    MailTitle = "平安回家",
                    --邮件内容
                    MailContent = "尊敬的少侠，感谢你的无私帮助，护送我们离开了海妖的领地，使我们免受了海妖的威胁。这是我们小渔村村民的一点心意，请收下。",
                    --护送超时提示
                    TimeOutMsg = "您护送的渔民遭遇海妖袭击，身首异处",
                },
            },
            {   
                NPCKeyName = "渔民",
                StartPoint = {49, 128, 10},
                EscortPoint = {
                    {105, 78, 10},
                    {148, 46, 5},
                    {168, 109, 10},
                },
                MoveSpeed = 110,
                --存在时长
                Duration = 10*60,
                --检测时间间隔
                CheckInterval = 2,
                --检测距离
                CheckRange = 20,
                --每次检测加分
                AddIntegral = 1,
                --护送限时
                LimitTime = 10*60,
                --刷怪规则1：怪物根据进度刷新
                RefreshMonsterProgress = {
                    {10,35},{40,65},{70,95},
                },
                --刷怪规则2：时间间隔刷怪
                RefreshMonsterInterval = 0,
                --刷怪规则2：怪物最多刷新次数
                RefreshMonsterNum = 0,
                --怪物列表
                MonsterConfig = {
                    {NPCKeyName = "劫匪头领", MonID = 6263},
            
                },
                MonsterIntegral = {
                    --战斗胜利后所有参与者加分
                    ["All"] = 1,
                    --战斗胜利后胜利队伍额外加分
                    ["Winner"] = 30, 
                    
                }, 

                Info = {
                    --任务名
                    TaskTitle = "渔火护行",
                    --简要任务介绍
                    BriefInfo = "护送渔民穿越险恶海岸，迎来丰收鱼潮",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "傲来村近期遭受渔业危机，海域中的鱼群急剧减少，使得渔民们生计艰难。受村民委托，护送渔民离开危险的海岸，到达新的捕鱼场所。",
                        [2] = "保护渔民免受盗匪的袭击，确保他们平安抵达目的地。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "有谁能听见吗？我们急需帮助！",
                        --进行中npc聊天气泡，分阶段
                        [2] = {
                            [1] = "少侠，请保护我们平安度过这段危险的旅程！",
                            [2] = "啊！盗匪出现了！快来支援！",
                        },
                        [3] = "多亏了你，我们终于平安抵达了。谢谢你，少侠！",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "你愿意帮助我们离开这片危险的海岸吗？",
                        --进行中npc对话，分阶段
                        [2] = {
                            [1] = "小心！盗匪要来了！",
                            [2] = "这是我们的绝境，少侠。我们必须一起战斗！",
                        },
                        [3] = "多亏了你，我们终于平安抵达了。谢谢你，少侠！",
                    },
                    --发件人 ""表示被护送的NPC名字  --客户端不显示
                    MailSendName = "渔民",
                    --邮件标题
                    MailTitle = "感恩有你",
                    --邮件内容
                    MailContent = "尊敬的少侠，感谢你护送我们离开危险的海岸。你为傲来村带来了新的希望，我们永远感激不尽。",
                    --护送超时提示
                    TimeOutMsg = "您护送的渔民被匪盗赶回了险恶海岸",
                },
            },
        },
        ["大唐国境"] = {  
            {   
                NPCKeyName = "边防队长",
                StartPoint = {324, 93, 10},
                EscortPoint = {
                    {131, 83, 10},
                    {48, 166, 5},
                    {182, 87, 10},
                },
                MoveSpeed = 110,
                --存在时长
                Duration = 10*60,
                --检测时间间隔
                CheckInterval = 2,
                --检测距离
                CheckRange = 20,
                --每次检测加分
                AddIntegral = 1,
                --护送限时
                LimitTime = 10*60,
                --刷怪规则1：怪物根据进度刷新
                RefreshMonsterProgress = {
                    {10,35},{40,65},{70,95},
                },
                --刷怪规则2：时间间隔刷怪
                RefreshMonsterInterval = 0,
                --刷怪规则2：怪物最多刷新次数
                RefreshMonsterNum = 0,
                --怪物列表
                MonsterConfig = {
                    {NPCKeyName = "边境匪首", MonID = 6266},
            
                },
                MonsterIntegral = {
                    --战斗胜利后所有参与者加分
                    ["All"] = 1,
                    --战斗胜利后胜利队伍额外加分
                    ["Winner"] = 30, 
                    
                }, 

                Info = {
                    --任务名
                    TaskTitle = "边境巡逻",
                    --简要任务介绍
                    BriefInfo = "在大唐国境执行巡逻任务，保卫边境安全",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "边境，是国家的第一道防线，需要时刻保持警惕。",
                        [2] = "少侠受命于朝廷，在辽阔的边境荒野和险峻的山脉中执行边境巡逻任务，保卫国家的安全。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "前方是国家边境，我们需要更多勇士来巡逻，保卫国土安全！",
                        --进行中npc聊天气泡，分阶段
                        [2] = {
                            [1] = "我们的任务是守护国家的边境，任何敌人都不能逃脱我们的眼睛！",
                            [2] = "敌袭！快来支援！",
                        },
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "国家边境安全仰赖你们的巡逻，你愿意为国家安全付出一份力吗？",
                        --进行中npc对话，分阶段
                        [2] = {
                            [1] = "小心！前方可能有敌人潜伏！",
                            [2] = "这是大唐的第一道防线，我们必须坚守阵地，击退敌人的进攻！",
                        },
                    },
                    -- 敌方首领喊话： "国家的边境是我们的目标，你们这些卫兵休想阻止我们！"
                    -- 敌方首领对话： "你们只是一群孱弱的卫兵，你们无法阻止我们的大军！"
                    --发件人 ""表示被护送的NPC名字  --客户端不显示
                    MailSendName = "边防队长",
                    --邮件标题
                    MailTitle = "边境守卫者",
                    --邮件内容
                    MailContent = "尊敬的守卫者，感谢你在我国边境的巡逻中所做出的努力，你守护了国家的安全，这是你的奖励。希望你能继续保卫边疆！国境卫士队长敬上。",
                    --护送超时提示
                    TimeOutMsg = "您守护的边境遭匪徒入境，大肆掳掠",
                },
            },
            {   
                NPCKeyName = "贸易使",
                StartPoint = {49, 128, 10},
                EscortPoint = {
                    {105, 78, 10},
                    {152, 75, 5},
                    {168, 109, 10},
                },
                MoveSpeed = 110,
                --存在时长
                Duration = 10*60,
                --检测时间间隔
                CheckInterval = 2,
                --检测距离
                CheckRange = 20,
                --每次检测加分
                AddIntegral = 1,
                --护送限时
                LimitTime = 10*60,
                --刷怪规则1：怪物根据进度刷新
                RefreshMonsterProgress = {
                    {10,35},{40,65},{70,95},
                },
                --刷怪规则2：时间间隔刷怪
                RefreshMonsterInterval = 0,
                --刷怪规则2：怪物最多刷新次数
                RefreshMonsterNum = 0,
                --怪物列表
                MonsterConfig = {
                    {NPCKeyName = "走私大佬", MonID = 6267},
            
                },
                MonsterIntegral = {
                    --战斗胜利后所有参与者加分
                    ["All"] = 1,
                    --战斗胜利后胜利队伍额外加分
                    ["Winner"] = 30, 
                    
                }, 

                Info = {
                    --任务名
                    TaskTitle = "边境商贸",
                    --简要任务介绍
                    BriefInfo = "护送货物穿越国家边境，确保贸易顺利进行",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "国境，不仅是国家的防线，也是贸易的重要通道。少侠受朝廷委派，确保货物顺利穿越边境，推动贸易发展。",
                        [2] = "在边境城镇和商贸驿站中，保护货物安全抵达目的地，推动边境贸易的繁荣。",
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "欢迎来到国境，我们需要更多的商人来促进边境贸易！",
                        --进行中npc聊天气泡，分阶段
                        [2] = {
                            [1] = "货物出发了，请保护好它们，确保安全抵达目的地！",
                            [2] = "国家间的贸易是我们的目标，你们这些走私者休想阻止我们！",
                        },
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "年轻人，你愿意成为我们边境贸易的一员吗？国家的繁荣需要你的贡献！",
                        --进行中npc对话，分阶段
                        [2] = {
                            [1] = "商贸活动是促进国家繁荣的重要手段，让我们一起努力吧！",
                            [2] = "商贩之间的竞争是商业发展的一部分，但务必保持诚信和公平竞争！",
                        },
                    },
                    -- 走私集团喊话： "这批货物是我的，你们不要想抢我的生意！"
                    -- 走私集团对话： "你们只是一群贪婪的商人，我不会让你们轻易通过边境！"
                    --发件人 ""表示被护送的NPC名字  --客户端不显示
                    MailSendName = "边境贸易办",
                    --邮件标题
                    MailTitle = "贸易守护者",
                    --邮件内容
                    MailContent = "尊敬的护送使者，感谢你在大唐边境的护送任务中所做出的贡献，你保护了货物的安全，推动了边境贸易的发展。这是你的奖励。希望你能继续为国家的贸易发展做出贡献！边境贸易办敬上。",
                    --护送超时提示
                    TimeOutMsg = "您护送的贸易处于危险中，走私在边境盛行",
                },
            },
        },


    },

    Reward = {
        {
            --需要达到的积分
            ["IntegralStage"] = 50,

            ["Exp"] = 0,
	        ["MoneyType"] = 5,
	        ["MoneyVal"] = "2000 + 100 * Integral",
	        ["Item"] = {"护送回礼1",1,0},
        },
        {
            --需要达到的积分
            ["IntegralStage"] = 80,

            ["Exp"] = 0,
	        ["MoneyType"] = 5,
	        ["MoneyVal"] = "4000 + 150 * Integral",
	        ["Item"] = {"护送回礼2",1,0},
        },
        {
            --需要达到的积分
            ["IntegralStage"] = 120,

            ["Exp"] = 0,
	        ["MoneyType"] = 5,
	        ["MoneyVal"] = "10000 + 200 * Integral",
	        ["Item"] = {"护送回礼3",1,0},
        },
    },

}

--收集任务配置
RegionTaskConfig.Collect = {
    --详细界面中提示
    Tips = "与其他义士一同帮助目标收集他们所需的物品或消息，击败敌人！<color=#FF0000FF>（目标收集到所需的物品数量后，会在原地停留一段时间，期间可继续提交道具，最后根据提交道具数目获得相应的感谢邮件）</color>",
    --完成任务后NPC停留时间 收集活动中NPC原本就会在完成任务后停留一段时间，没有其他需求的话，这个直接填0即可
    FinishRemainTime = 0,
    --完成任务在简要界面的提示
    FinishBriefInfo = "寻物已完成，已根据您的参与度$Integral$获得感谢邮件",


    CollectRefresh = {
        ["长安城"] = {
            {   
                NPCKeyName = "古董店老板",
                StartPoint = {610, 150, 5},
                --存在时长
                Duration = 10*60,
                --收集限时
                LimitTime = 10*60,
                --需求道具数
                NeedItemNum = 130,
                --集齐道具后存在时间
                LastTime = 1*60,
                --提交道具与积分兑换比 1道具换1积分
                Scale = 1,
                --刷新怪物间隔
                RefreshMonsterInterval = 120,
                --单次刷新怪物数量
                RefreshMonsterNum = {1, 3},
                --怪物最多刷新次数
                RefreshMonsterMaxNum = 3,
                --怪物列表  ItemNum战斗胜利后获得的道具数量
                MonsterConfig = {
                    {NPCKeyName = "古籍盗贼", MonID = 6268, ItemNum = 30, Range = 20},
            
                },
                --刷新宝箱间隔
                RefreshBoxInterval = 70,
                --单次刷新怪物数量
                RefreshBoxNum = {1, 3},
                --宝箱最多刷新次数
                RefreshBoxMaxNum = 5,
                --宝箱列表  ItemNum打开宝箱后获得的道具数量
                BoxConfig = {
                    {NPCKeyName = "神秘宝箱", OpenTime = 5, ItemNum = 10, Range = 20}

                },
                --开宝箱时的文本
                BoxTips = "打开宝箱中...",

                --中断开宝箱时的文本
                BoxStopTips = "中断打开宝箱",

                --寻物文本
                ItemTips = "古籍残卷",

                Info = {
                    --任务名
                    TaskTitle = "古籍之谜",
                    --简要任务介绍
                    BriefInfo = "帮助古董店老板找到失窃的古籍残卷",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "在长安城的一处古董店中，许多古籍残卷不翼而飞，老板急得满头大汗不知如何是好。",
                        [2] = "请帮助古董店老板找回丢失的古籍残卷，注意周围有没有什么可疑的人或物",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "少侠！古董店丢失了许多珍贵的古籍残卷，请帮助我们找回来！",
                        --进行中npc聊天气泡，分阶段
                        [2] = "少侠请多多调查附近可疑的人和物，残卷可能就在其中。",
                        [3] = "感谢各位少侠！大部分古籍残卷已经回收，在下还会在此处停留一段时间继续寻找是否还有遗漏。",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "少侠！这些残卷对我们十分重要，如果能够得到你们的帮助就太好了！",
                        --进行中npc对话，分阶段
                        [2] = "进展如何？若是没有线索可多多观察周围可疑的人或物。",
                        [3] = "古籍残卷已经回收了十之八九，感谢诸位侠士的帮助，剩下的一些在下还会在这里找找。",
                    },

                    --发件人
                    MailSendName = "古董店老板",
                    --邮件标题
                    MailTitle = "古籍之谜",
                    --邮件内容
                    MailContent = "尊敬的少侠，感谢你为我找回了这些珍贵的古籍残卷，你的勇气和智慧将永远被铭记在我的心中，这是你的奖励。",
                    --寻物超时提示
                    TimeOutMsg = "古籍残卷找不回来了，古董店被迫关门。",
                },

            },
            {   
                NPCKeyName = "情报商",
                StartPoint = {318, 131, 5},
                --存在时长
                Duration = 10*60,
                --收集限时
                LimitTime = 10*60,
                --需求道具数
                NeedItemNum = 130,
                --集齐道具后存在时间
                LastTime = 1*60,
                --提交道具与积分兑换比 1道具换1积分
                Scale = 1,
                --刷新怪物间隔
                RefreshMonsterInterval = 120,
                --单次刷新怪物数量
                RefreshMonsterNum = {1, 3},
                --怪物最多刷新次数
                RefreshMonsterMaxNum = 3,
                --怪物列表  ItemNum战斗胜利后获得的道具数量
                MonsterConfig = {
                    {NPCKeyName = "神秘人士", MonID = 6269, ItemNum = 30, Range = 20},
            
                },
                --刷新宝箱间隔
                RefreshBoxInterval = 70,
                --单次刷新怪物数量
                RefreshBoxNum = {1, 3},
                --宝箱最多刷新次数
                RefreshBoxMaxNum = 5,
                --宝箱列表  ItemNum打开宝箱后获得的道具数量
                BoxConfig = {
                    {NPCKeyName = "自言自语的怪人", OpenTime = 5, ItemNum = 10, Range = 20}

                },
                --开宝箱时的文本
                BoxTips = "调查中...",

                --中断开宝箱时的文本
                BoxStopTips = "停止调查",

                --寻物文本
                ItemTips = "情报",

                Info = {
                    --任务名
                    TaskTitle = "搜集情报",
                    --简要任务介绍
                    BriefInfo = "替情报贩子搜集一些有用的情报",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "长安城角落处的一家情报商近期人手不够，城外又来了一批神秘人物，需要人帮忙调查一下那批人物的来头。",
                        [2] = "请帮助情报商收集情报，看看附近有没有什么可值得调查一番的东西吧。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "各位侠士，我需要你们的帮助！长安城外出现一批神秘人物，我需要了解他们的来历、目的和实力。",
                        --进行中npc聊天气泡，分阶段
                        [2] = "这批神秘人物似乎比较喜欢穿黑衣白衣，请少侠多多留意他们的动向。",
                        [3] = "感谢各位少侠！我们已经大致了解他们所图为何了，当然，若是有更为细致的情报也都可以提供给我们。",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "少侠，最近城外来了一批神秘人物，看起来十分可疑，可是我们最近人手不够分不出精力去打探他们的来历，能否请你们帮忙呢。",
                        --进行中npc对话，分阶段
                        [2] = "你带来了关于神秘势力的情报吗？让我们来看看。",
                        [3] = "多谢各位少侠的打探，这些家伙的底细我们已经了解了，不过若是还有什么其他情报我们也照收不误。",
                    },
                    --发件人
                    MailSendName = "情报商",
                    --邮件标题
                    MailTitle = "搜集情报",
                    --邮件内容
                    MailContent = "尊敬的少侠，感谢你的努力调查，为长安城的治安做出了巨大的贡献，这是你的奖励。",
                    --寻物超时提示
                    TimeOutMsg = "神秘势力在长安城大肆作乱，城内百姓叫苦不迭。",
                },

            },

        },
        ["江南野外"] = {
            {   
                NPCKeyName = "朝廷卫兵",
                StartPoint = {161, 174, 5},
                --存在时长
                Duration = 10*60,
                --收集限时
                LimitTime = 10*60,
                --需求道具数
                NeedItemNum = 130,
                --集齐道具后存在时间
                LastTime = 1*60,
                --提交道具与积分兑换比 1道具换1积分
                Scale = 1,
                --刷新怪物间隔
                RefreshMonsterInterval = 120,
                --单次刷新怪物数量
                RefreshMonsterNum = {1, 3},
                --怪物最多刷新次数
                RefreshMonsterMaxNum = 3,
                --怪物列表  ItemNum战斗胜利后获得的道具数量
                MonsterConfig = {
                    {NPCKeyName = "妖狐", MonID = 6270, ItemNum = 30, Range = 20},
            
                },
                --刷新宝箱间隔
                RefreshBoxInterval = 70,
                --单次刷新怪物数量
                RefreshBoxNum = {1, 3},
                --宝箱最多刷新次数
                RefreshBoxMaxNum = 5,
                --宝箱列表  ItemNum打开宝箱后获得的道具数量
                BoxConfig = {
                    {NPCKeyName = "妖狐幻象", OpenTime = 5, ItemNum = 10, Range = 20}

                },
                --开宝箱时的文本
                BoxTips = "驱散中...",

                --中断开宝箱时的文本
                BoxStopTips = "逃离狐妖幻象",

                --寻物文本
                ItemTips = "妖狐精魄",

                Info = {
                    --任务名
                    TaskTitle = "江南妖狐",
                    --简要任务介绍
                    BriefInfo = "消灭江南妖狐以及驱散其留下的妖雾。",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "近日在江南野外的深处，似乎有一只妖狐作乱，它以美貌迷惑人心，吸取人的精气，使得当地百姓生活在水深火热之中。",
                        [2] = "请帮助村民消灭妖狐，并清除其留下来祸乱人心的幻象。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "近日狐妖作乱，为害百姓，各位侠士，请帮帮我们。",
                        --进行中npc聊天气泡，分阶段
                        [2] = "这狐妖异常狡猾，还会使用幻象妖术蛊惑人心，诸位侠士多多小心。",
                        [3] = "多亏各位少侠，如今这妖狐已然重伤，想必不会再有能力危害百姓了。",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "少侠，近日这江南狐妖猖獗，祸乱百姓，朝廷派我等前来除妖，奈何这妖孽过于狡猾，我等无法根除，还望少侠施以援手。",
                        --进行中npc对话，分阶段
                        [2] = "少侠这狐妖擅长蛊惑人心，还能召唤妖雾，可不要让这妖怪逃走了。",
                        [3] = "多谢各位少侠的帮助，这妖狐如今已经无力危害百姓了，我等还会再停留一段时间，清扫狐妖遗留下来的影响。",
                    },

                    --发件人
                    MailSendName = "朝廷卫兵",
                    --邮件标题
                    MailTitle = "江南妖狐",
                    --邮件内容
                    MailContent = "尊敬的少侠，多亏了你们对狐妖的削弱，江南百姓不会忘记你们的付出的，这是你们的奖励。",
                    --寻物超时提示
                    TimeOutMsg = "妖狐实力大增，我们已经无法阻止它了，快撤退！",
                },

            },
            {   
                NPCKeyName = "庄园园主",
                StartPoint = {151, 81, 5},
                --存在时长
                Duration = 10*60,
                --收集限时
                LimitTime = 10*60,
                --需求道具数
                NeedItemNum = 130,
                --集齐道具后存在时间
                LastTime = 1*60,
                --提交道具与积分兑换比 1道具换1积分
                Scale = 1,
                --刷新怪物间隔
                RefreshMonsterInterval = 120,
                --单次刷新怪物数量
                RefreshMonsterNum = {1, 3},
                --怪物最多刷新次数
                RefreshMonsterMaxNum = 3,
                --怪物列表  ItemNum战斗胜利后获得的道具数量
                MonsterConfig = {
                    {NPCKeyName = "强盗", MonID = 6271, ItemNum = 30, Range = 20},
            
                },
                --刷新宝箱间隔
                RefreshBoxInterval = 70,
                --单次刷新怪物数量
                RefreshBoxNum = {1, 3},
                --宝箱最多刷新次数
                RefreshBoxMaxNum = 5,
                --宝箱列表  ItemNum打开宝箱后获得的道具数量
                BoxConfig = {
                    {NPCKeyName = "庄园财物", OpenTime = 5, ItemNum = 10, Range = 20}

                },
                --开宝箱时的文本
                BoxTips = "调查中...",

                --中断开宝箱时的文本
                BoxStopTips = "中断收集财物",

                --寻物文本
                ItemTips = "庄园财物",

                Info = {
                    --任务名
                    TaskTitle = "野外寻宝",
                    --简要任务介绍
                    BriefInfo = "帮助庄园主取回失物。",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "一家庄园昨日夜里被强盗袭击，损失了大量财物。",
                        [2] = "请帮助庄园主找回被抢走的物品，并给这伙强盗一些教训。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "各位侠士，我的庄园最近遭受了一伙强盗的袭击，我们失去了许多珍贵的财物，希望有人可以帮我把失物追寻回来",
                        --进行中npc聊天气泡，分阶段
                        [2] = "这伙强盗可能把失物藏在角落了，也可能就带在身上，请少侠多加留意。",
                        [3] = "多谢各位少侠，大部分失物已经追回。",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "少侠！我的庄园最近遭受了一伙强盗的袭击，我们失去了许多珍贵的财物。我需要你的帮助来找回这些失物。它们很可能被藏在江南野外的某个地方。你能帮我吗？",
                        --进行中npc对话，分阶段
                        [2] = "少侠，强盗可能还在附近，请务必小心行事。祝你好运。",
                        [3] = "多谢各位少侠的帮助，现在大部分失物都已经追回来了，但是周围可能还有一些强盗滞留，请各位小心。",
                    },

                    --发件人
                    MailSendName = "庄园园主",
                    --邮件标题
                    MailTitle = "野外寻宝",
                    --邮件内容
                    MailContent = "尊敬的少侠，感谢你替我找回了丢失的财物，这是给你的酬谢。",
                    --寻物超时提示
                    TimeOutMsg = "强盗们带着宝物远走高飞了，庄园园主承受了巨大的损失。",
                },

            },
        },

        ["东海海湾"] = {
            {   
                NPCKeyName = "东海龙王",
                StartPoint = {144, 127, 5},
                --存在时长
                Duration = 10*60,
                --收集限时
                LimitTime = 10*60,
                --需求道具数
                NeedItemNum = 130,
                --集齐道具后存在时间
                LastTime = 1*60,
                --提交道具与积分兑换比 1道具换1积分
                Scale = 1,
                --刷新怪物间隔
                RefreshMonsterInterval = 120,
                --单次刷新怪物数量
                RefreshMonsterNum = {1, 3},
                --怪物最多刷新次数
                RefreshMonsterMaxNum = 3,
                --怪物列表  ItemNum战斗胜利后获得的道具数量
                MonsterConfig = {
                    {NPCKeyName = "迷失的螃蟹", MonID = 6272, ItemNum = 30, Range = 20},
            
                },
                --刷新宝箱间隔
                RefreshBoxInterval = 70,
                --单次刷新怪物数量
                RefreshBoxNum = {1, 3},
                --宝箱最多刷新次数
                RefreshBoxMaxNum = 5,
                --宝箱列表  ItemNum打开宝箱后获得的道具数量
                BoxConfig = {
                    {NPCKeyName = "龙珠碎片", OpenTime = 5, ItemNum = 10, Range = 20}

                },
                --开宝箱时的文本
                BoxTips = "采集中...",

                --中断开宝箱时的文本
                BoxStopTips = "停止采集",

                --寻物文本
                ItemTips = "龙珠碎片",

                Info = {
                    --任务名
                    TaskTitle = "东海秘宝",
                    --简要任务介绍
                    BriefInfo = "为龙王找回龙珠碎片。",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "近期，东海的海域出现了一些异常现象，渔民们都无法顺利打鱼了，有消息称这是因为东海龙宫中的宝物龙珠寿命到了产生裂痕，散落许多龙珠碎片导致的。",
                        [2] = "请帮助龙海龙王找回龙珠碎片，修复龙珠，让东海海湾重回平静。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "各位侠士，近日东海大乱，希望各位可以帮助我拯救东海！",
                        --进行中npc聊天气泡，分阶段
                        [2] = "海中的龙珠碎片，隐藏着无尽的力量。侠士需深入海底，探寻其真实所在。",
                        [3] = "感谢侠士的英勇行为，龙珠已经大致修复，可以保东海平静了。",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "少侠，近日东海龙珠碎裂，碎片散落在东海海湾各地，希望你们可以帮助我找回来，修补龙珠。",
                        --进行中npc对话，分阶段
                        [2] = "这龙珠碎片颇有灵性，也不不光是散落各地，也可能附着在一些虾兵蟹将身上。",
                        [3] = "多谢各位少侠的帮助，龙珠已经可以恢复功能，虽然还有小部分碎片尚未找回，但已经可以平复东海之乱了。",
                    },

                    --发件人
                    MailSendName = "龙海龙王",
                    --邮件标题
                    MailTitle = "东海秘宝",
                    --邮件内容
                    MailContent = "尊敬的少侠，多谢你们找回的龙珠碎片，否则这东海恐怕还要再乱上一阵，这是给你们的奖励。",
                    --寻物超时提示
                    TimeOutMsg = "龙珠破碎了，这场风浪也许还要持续很久......",
                },

            },
            {   
                NPCKeyName = "唐王特使",
                StartPoint = {50, 117, 5},
                --存在时长
                Duration = 10*60,
                --收集限时
                LimitTime = 10*60,
                --需求道具数
                NeedItemNum = 130,
                --集齐道具后存在时间
                LastTime = 1*60,
                --提交道具与积分兑换比 1道具换1积分
                Scale = 1,
                --刷新怪物间隔
                RefreshMonsterInterval = 120,
                --单次刷新怪物数量
                RefreshMonsterNum = {1, 3},
                --怪物最多刷新次数
                RefreshMonsterMaxNum = 3,
                --怪物列表  ItemNum战斗胜利后获得的道具数量
                MonsterConfig = {
                    {NPCKeyName = "海妖", MonID = 6273, ItemNum = 30, Range = 20},
            
                },
                --刷新宝箱间隔
                RefreshBoxInterval = 70,
                --单次刷新怪物数量
                RefreshBoxNum = {1, 3},
                --宝箱最多刷新次数
                RefreshBoxMaxNum = 5,
                --宝箱列表  ItemNum打开宝箱后获得的道具数量
                BoxConfig = {
                    {NPCKeyName = "被蛊惑的渔民", OpenTime = 5, ItemNum = 10, Range = 20}

                },
                --开宝箱时的文本
                BoxTips = "唤醒中...",

                --中断开宝箱时的文本
                BoxStopTips = "中断唤醒渔民",

                --寻物文本
                ItemTips = "海妖之魂",


                Info = {
                    --任务名
                    TaskTitle = "海妖之怒",
                    --简要任务介绍
                    BriefInfo = "消灭海妖，救回失踪的渔民。",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "近期，东海海湾频繁发生渔民失踪事件，经过调查，发现这些事件都与一股神秘的海妖力量有关。",
                        [2] = "请消灭这些海妖，并救回被海妖控制住的渔民吧。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "各位侠士，近日海妖作乱东海，请帮助我们将其消灭。",
                        --进行中npc聊天气泡，分阶段
                        [2] = "这些海妖有蛊惑之术，若是碰上被蛊惑的渔民，请唤醒他们。",
                        [3] = "感谢各位少侠！海妖之乱已经平息，还剩余一些海妖余孽和小部分渔民我们的人手足够拯救了。",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "少侠，我是唐王派下来的特使，听闻近日东海有海妖作乱，特来派遣我们平定风波，不过我们人手不足，请少侠助我们一臂之力！",
                        --进行中npc对话，分阶段
                        [2] = "这些海妖有蛊惑之术，若是碰上被蛊惑的渔民，请勿要痛下杀手，将其唤醒即可。",
                        [3] = "多谢各位少侠，剩下的海妖不足为惧，我们也终于可以腾出人手唤醒剩下的渔民了。",
                    },

                    --发件人
                    MailSendName = "唐王特使",
                    --邮件标题
                    MailTitle = "海妖之怒",
                    --邮件内容
                    MailContent = "尊敬的少侠，感谢你们的付出，这些海妖猖獗不了多久了，这是给你们的酬劳。",
                    --寻物超时提示
                    TimeOutMsg = "海妖肆虐，这些渔民也许永远无法唤醒了。",
                },

            },
        },

        ["大唐国境"] = {
            {   
                NPCKeyName = "边疆卫士",
                StartPoint = {110, 55, 5},
                --存在时长
                Duration = 10*60,
                --收集限时
                LimitTime = 10*60,
                --需求道具数
                NeedItemNum = 130,
                --集齐道具后存在时间
                LastTime = 1*60,
                --提交道具与积分兑换比 1道具换1积分
                Scale = 1,
                --刷新怪物间隔
                RefreshMonsterInterval = 120,
                --单次刷新怪物数量
                RefreshMonsterNum = {1, 3},
                --怪物最多刷新次数
                RefreshMonsterMaxNum = 3,
                --怪物列表  ItemNum战斗胜利后获得的道具数量
                MonsterConfig = {
                    {NPCKeyName = "外敌势力", MonID = 6274, ItemNum = 30, Range = 20},
            
                },
                --刷新宝箱间隔
                RefreshBoxInterval = 70,
                --单次刷新怪物数量
                RefreshBoxNum = {1, 3},
                --宝箱最多刷新次数
                RefreshBoxMaxNum = 5,
                --宝箱列表  ItemNum打开宝箱后获得的道具数量
                BoxConfig = {
                    {NPCKeyName = "外敌物资", OpenTime = 5, ItemNum = 10, Range = 20}

                },
                --开宝箱时的文本
                BoxTips = "调查中...",

                --中断开宝箱时的文本
                BoxStopTips = "停止调查",

                --寻物文本
                ItemTips = "外敌情报",

                Info = {
                    --任务名
                    TaskTitle = "边境守护",
                    --简要任务介绍
                    BriefInfo = "消灭在国境不安分的敌对势力，并调查他们的情报。",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "外敌势力在边境地区活动频繁，他们试图侵犯我国领土。请前往边境地区，调查敌势力的动向，并采取措施阻止他们的侵犯。",
                        [2] = "护国边疆，请消灭这些外敌势力，若是有余力，可以调查一下有关他们的情报就更好了。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "各位侠士，边境地区出现了一些不稳定因素，有外敌势力企图侵犯我国领土。为了维护边境的安全，我们需要你们的帮助。",
                        --进行中npc聊天气泡，分阶段
                        [2] = "侠士们若是有关于外敌势力的情报，也尽可以交付给我们，这对我们十分重要。",
                        [3] = "感谢各位少侠！成功阻止了敌对势力对我们国境的侵犯！",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "少侠，我们边境地区最近有些不稳定，有外敌势力企图侵犯我国领土。为了维护边境的安全，我们需要你的帮助。请你前往边境地区，调查敌势力的动向，并采取措施阻止他们的侵犯。你能帮我吗？",
                        --进行中npc对话，分阶段
                        [2] = "侠士，有什么新的发现吗？请仔细调查敌势力的动向，保护我国领土的安全，阻止他们的侵犯。如果有需要，我会派人协助你。",
                        [3] = "多谢各位少侠，你们的勇气和智慧为我们守护了边境的安全！",
                    },

                    --发件人
                    MailSendName = "边疆卫士",
                    --邮件标题
                    MailTitle = "边境守护",
                    --邮件内容
                    MailContent = "尊敬的少侠，你们为国土安定做出了巨大的贡献，百姓会永远记得你们的功绩的，这是给你们的奖励。",
                    --寻物超时提示
                    TimeOutMsg = "边境失守！大唐国土将迎来严峻的挑战。",
                },

            },
            {   
                NPCKeyName = "天竺使者",
                StartPoint = {267, 75, 5},
                --存在时长
                Duration = 10*60,
                --收集限时
                LimitTime = 10*60,
                --需求道具数
                NeedItemNum = 130,
                --集齐道具后存在时间
                LastTime = 1*60,
                --提交道具与积分兑换比 1道具换1积分
                Scale = 1,
                --刷新怪物间隔
                RefreshMonsterInterval = 120,
                --单次刷新怪物数量
                RefreshMonsterNum = {1, 3},
                --怪物最多刷新次数
                RefreshMonsterMaxNum = 3,
                --怪物列表  ItemNum战斗胜利后获得的道具数量
                MonsterConfig = {
                    {NPCKeyName = "边境盗贼", MonID = 6275, ItemNum = 30, Range = 20},
            
                },
                --刷新宝箱间隔
                RefreshBoxInterval = 70,
                --单次刷新怪物数量
                RefreshBoxNum = {1, 3},
                --宝箱最多刷新次数
                RefreshBoxMaxNum = 5,
                --宝箱列表  ItemNum打开宝箱后获得的道具数量
                BoxConfig = {
                    {NPCKeyName = "丢失的宝物", OpenTime = 5, ItemNum = 10, Range = 20}

                },
                --开宝箱时的文本
                BoxTips = "调查中...",

                --中断开宝箱时的文本
                BoxStopTips = "停止寻找宝物",

                --寻物文本
                ItemTips = "天竺秘宝",

                Info = {
                    --任务名
                    TaskTitle = "天竺奇珍",
                    --简要任务介绍
                    BriefInfo = "寻回天竺国送来的秘宝",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "最近，天竺国使者来到大唐，为唐王带来了许多天竺的宝物，但宝物在进入大唐国境时丢失，可能是被盗贼偷走了。",
                        [2] = "请帮助天竺特使找回秘宝，并抓住偷取宝物的盗贼。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "我天竺国送往大唐的宝物不慎丢失了！请帮我找回这些宝物，我将重重酬谢！",
                        --进行中npc聊天气泡，分阶段
                        [2] = "请小心那些埋伏在深林中的盗贼，他们可能就是罪魁祸首！",
                        [3] = "感谢各位少侠！我们的宝物已经追回很多了，足够贡献给唐王，但是还是有些散落在外，希望少侠能够留意。",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "少侠，我天竺国送往大唐的宝物不慎丢失了。我能请你帮我找回这些对两国关系来说十分重要的宝物吗？", 
                        --进行中npc对话，分阶段
                        [2] = "少侠请多加小心这附近的盗贼，宝物也许就在他们身上。",
                        [3] = "多谢各位少侠的帮助，这些宝物已经足够贡献给唐王了。",
                    },

                    --发件人
                    MailSendName = "天竺使者",
                    --邮件标题
                    MailTitle = "天竺奇珍",
                    --邮件内容
                    MailContent = "尊敬的少侠，多谢你们，若是这些宝物找不回来，我真的不知道该如何是好了，这是给你们的谢礼。",
                    --寻物超时提示
                    TimeOutMsg = "偷走天竺国宝物的盗贼已经离开，无法追回宝物了。",
                },
            },
        },
        
    },
    NPC = {},
    Reward = {
        {
            --需要达到的积分
            ["IntegralStage"] = 50,

            ["Exp"] = 0,
	        ["MoneyType"] = 5,
	        ["MoneyVal"] = "2000 + 100 * Integral",
	        ["Item"] = {"收集回礼1",1,0},
        },
        {
            --需要达到的积分
            ["IntegralStage"] = 80,

            ["Exp"] = 0,
	        ["MoneyType"] = 5,
	        ["MoneyVal"] = "4000 + 150 * Integral",
	        ["Item"] = {"收集回礼2",1,0},
        },
        {
            --需要达到的积分
            ["IntegralStage"] = 120,

            ["Exp"] = 0,
	        ["MoneyType"] = 5,
	        ["MoneyVal"] = "10000 + 200 * Integral",
	        ["Item"] = {"收集回礼3",1,0},
        },

    },
}

--讨伐任务配置
RegionTaskConfig.Conquest = {
    --详细界面中提示
    Tips = "与其他义士一同帮助目标讨伐妖物！<color=#FF0000FF>（成功击败BOSS后，根据贡献值获得相应的感谢邮件）</color>",
    --完成任务后NPC停留时间 收集活动中NPC原本就会在完成任务后停留一段时间，没有其他需求的话，这个直接填0即可
    FinishRemainTime = 60,
    --完成任务在简要界面的提示
    FinishBriefInfo = "讨伐已完成，已根据您的参与度$Integral$获得感谢邮件",

    ConquestRefresh = {
        ["大唐境外"] = {
            {   
                NPCKeyName = "守墓老人",
                StartPoint = {97, 68, 5},
                --存在时长
                Duration = 10*60,
                --讨伐限时
                LimitTime = 10*60,
                --造成伤害获得积分比例，小怪和BOSS都计入
                Scale = 0.05,
                --BOSS配置
                BossName = "恶灵",
                --小怪配置(每次召唤)  site召唤出来的小怪站位
                MonsterConfig = {
                    {MonsterKeyName = "讨伐1-小怪1", site = 2},
                    {MonsterKeyName = "讨伐1-小怪1", site = 3},
                    {MonsterKeyName = "讨伐2-小怪1", site = 4},
                    {MonsterKeyName = "讨伐2-小怪1", site = 5},
                },

                Info = {
                    --任务名
                    TaskTitle = "古墓恶灵",
                    --简要任务介绍
                    BriefInfo = "帮助守墓老人剿灭附在其身体中的恶灵",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "在大唐境外的某处地方，一位守墓老人正神色痛苦地大声呼救，似乎身上有恶灵正在折磨着他。",
                        [2] = "请帮助守墓老人驱逐附在其身上的恶灵，让老人家恢复原状。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "谁能来救救我？我感觉我的脑海里有个人一直在对我说话！",
                        --进行中npc聊天气泡，分阶段
                        [2] = "哈哈哈哈哈哈！这就是自由的感觉吗！",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "少侠！请救救我！近日来我总感觉脑海里好像有个声音对我叨叨不休，吃不好也睡不好，请帮我看看是不是身上附上了什么不干净的东西。",
                        --进行中npc对话，分阶段
                        [2] = "哇哈哈哈哈哈！这老头的身体虽然都快入土了，但清理你们几个小杂毛也还算够用。",
                        [3] = "感谢各位少侠！小老儿捡回一命。若不是少侠出手相助，还真不知会变成什么样。",
                    },

                    --发件人
                    MailSendName = "守墓老人",
                    --邮件标题
                    MailTitle = "古墓恶灵",
                    --邮件内容
                    MailContent = "尊敬的少侠，感谢你帮助我驱逐了恶灵，解决了困扰我许多天的是问题，请收下这一点微不足道的谢礼。",
                    --寻物超时提示
                    TimeOutMsg = "没能阻止恶灵，它掀起了一阵腥风血雨。",
                },

            },
        },
        ["玄阴池"] = {
            {   
                NPCKeyName = "奇怪的宝箱",
                StartPoint = {179, 118, 5},
                --存在时长
                Duration = 10*60,
                --讨伐限时
                LimitTime = 10*60,
                --造成伤害获得积分比例，小怪和BOSS都计入
                Scale = 0.05,
                --BOSS配置
                BossName = "奇怪的宝箱",
                --小怪配置(每次召唤)  site召唤出来的小怪站位
                MonsterConfig = {
                    {MonsterKeyName = "讨伐3-小怪1", site = 2},
                    {MonsterKeyName = "讨伐3-小怪1", site = 3},
                    {MonsterKeyName = "讨伐4-小怪1", site = 4},
                    {MonsterKeyName = "讨伐4-小怪1", site = 5},
                },

                Info = {
                    --任务名
                    TaskTitle = "冰池奇事",
                    --简要任务介绍
                    BriefInfo = "击败玄阴池中猖狂的宝箱",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "玄阴池中央有一个奇怪的宝箱，去看看是什么状况。",
                        [2] = "请打败这个不可一世的宝箱，不要让他四处捣乱了。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "哇啊啊啊啊，我感觉我现在天下无敌！",
                        --进行中npc聊天气泡，分阶段
                        [2] = "哦？就凭你也敢挑战本宝箱！",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "你是谁？不要随便跟我搭话好不好，是不是找打！",
                        --进行中npc对话，分阶段
                        [2] = "可恶！敢不敢和我打一架。",
                        [3] = "居然被这不知名的臭小子打败了......",
                    },

                    --发件人
                    MailSendName = "奇怪的宝箱",
                    --邮件标题
                    MailTitle = "冰池奇事",
                    --邮件内容
                    MailContent = "好好好，这次算你们厉害，这些东西就当是我赏你们的，下次我可不会再输了！",
                    --寻物超时提示
                    TimeOutMsg = "没有战胜这个猖狂的小宝箱，被它笑话了好一阵子。",
                },

            },
        },
        ["长安城"] = {
            {   
                NPCKeyName = "凶恶大汉",
                StartPoint = {493, 250, 5},
                --存在时长
                Duration = 10*60,
                --讨伐限时
                LimitTime = 10*60,
                --造成伤害获得积分比例，小怪和BOSS都计入
                Scale = 0.05,
                --BOSS配置
                BossName = "凶恶大汉",
                --小怪配置(每次召唤)  site召唤出来的小怪站位
                MonsterConfig = {
                    {MonsterKeyName = "讨伐5-小怪1", site = 2},
                    {MonsterKeyName = "讨伐5-小怪1", site = 3},
                    {MonsterKeyName = "讨伐6-小怪1", site = 4},
                    {MonsterKeyName = "讨伐6-小怪1", site = 5},
                },

                Info = {
                    --任务名
                    TaskTitle = "长安恶霸",
                    --简要任务介绍
                    BriefInfo = "狠狠地教训长安城无恶不作的可恨恶霸",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "近日来长安城有些鸡犬不宁，经调查是不知从哪冒出来个实力惊人的大汉，整日带着小弟无恶不作，太过可恶。",
                        [2] = "请一定要打败这个恶霸，还长安城一份安宁。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "这所谓长安城，我看也不过如此！",
                        --进行中npc聊天气泡，分阶段
                        [2] = "终于有不长眼的要来找死了吗，哈哈哈！",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "偌大一个长安城，竟无一人能出手治我，我看这地方也不过是浪得虚名罢了！",
                        --进行中npc对话，分阶段
                        [2] = "你这杂毛敢来挑战本大爷，也算你有些胆量。",
                        [3] = "少侠饶命！我以后一定老老实实，遵纪守法，做一个良好市民！",
                    },

                    --发件人
                    MailSendName = "老实大汉",
                    --邮件标题
                    MailTitle = "长安恶霸",
                    --邮件内容
                    MailContent = "多谢少侠饶命！刚刚是小人说话太大声了，想不到长安城竟有少侠这等高手。这是小的给您的一点微薄心意，请少侠务必收下！",
                    --寻物超时提示
                    TimeOutMsg = "没有打败恶汉，他仍在长安城肆意欺人。",
                },

            },
        },
        ["解阳山"] = {
            {   
                NPCKeyName = "混沌妖王",
                StartPoint = {133, 101, 5},
                --存在时长
                Duration = 10*60,
                --讨伐限时
                LimitTime = 10*60,
                --造成伤害获得积分比例，小怪和BOSS都计入
                Scale = 0.05,
                --BOSS配置
                BossName = "混沌妖王",
                --小怪配置(每次召唤)  site召唤出来的小怪站位
                MonsterConfig = {
                    {MonsterKeyName = "讨伐7-小怪1", site = 2},
                    {MonsterKeyName = "讨伐7-小怪1", site = 3},
                    {MonsterKeyName = "讨伐8-小怪1", site = 4},
                    {MonsterKeyName = "讨伐8-小怪1", site = 5},
                },

                Info = {
                    --任务名
                    TaskTitle = "妖王降临",
                    --简要任务介绍
                    BriefInfo = "阻止妖王降世。",
                    --详细任务介绍
                    DetailInfo = {
                        [1] = "解阳山一处地点魔气骤增，经探子提供的情报是有人正在通过仪式想要召唤妖王。",
                        [2] = "请阻止妖王的召唤仪式，在其未能正式降临时将其打败。",
            
                    }, 

                    --聊天气泡间隔
                    ChatInterval = {10, 15},
                    --聊天气泡
                    Chat = {
                        --准备阶段npc聊天气泡
                        [1] = "我来看看，是谁在召唤我？",
                        --进行中npc聊天气泡，分阶段
                        [2] = "竟敢妄图打断本王的降临仪式，受死吧！",
                    },

                    --对话
                    Talk = {
                        --准备阶段npc对话
                        [1] = "凡人，是你在召唤本王吗？",
                        --进行中npc对话，分阶段
                        [2] = "原来是要打断仪式的蟊贼，看来你是准备好成为本王降临的祭品了吧！",
                        [3] = "可恶！本王、本王还会再回来的，你们等着迎接本王的怒火吧！",
                    },

                    --发件人
                    MailSendName = "大唐驿站",
                    --邮件标题
                    MailTitle = "妖王降临",
                    --邮件内容
                    MailContent = "多谢少侠出手阻止了妖王降世，若是让他成功降临，怕是少不了一番生灵涂炭呐，这是我长安对少侠的作为提供的一些谢礼，请收下！",
                    --寻物超时提示
                    TimeOutMsg = "妖王成功降世，解阳山一片生灵涂炭。",
                },

            },
        },
    },

    NPC = {},
    Reward = {
        {
            --需要达到的积分
            ["IntegralStage"] = 1000,
            ["Exp"] = 0,
	        ["MoneyType"] = 5,
	        ["MoneyVal"] = "2000 + Integral",
	        ["Item"] = {"收集回礼1",1,0},
        },
        {
            --需要达到的积分
            ["IntegralStage"] = 3000,
            ["Exp"] = 0,
	        ["MoneyType"] = 5,
	        ["MoneyVal"] = "4000 + 2 * Integral",
	        ["Item"] = {"收集回礼2",1,0},
        },
        {
            --需要达到的积分
            ["IntegralStage"] = 5000,
            ["Exp"] = 0,
	        ["MoneyType"] = 5,
	        ["MoneyVal"] = "10000 + 3 * Integral",
	        ["Item"] = {"收集回礼3",1,0},
        },

    },
}

--11032 回血   11033 减伤  11034 全属性   11035 加伤   11036 加速
--小怪配置
RegionTaskConfig.MonsterConfig = {
    --BOSS1
    ["讨伐1-小怪1"] = {
        --NPCKeyName
        NPCKeyName = "怨灵",
        --怪物组
        MonID = 6280,
        --BUFF  持续回血
        BUFFID = 11032,
        --连线特效ID 绿色
        LinkID = 3,
        --总血量
        MonsterMaxHP = 50000,    
    },
    ["讨伐2-小怪1"] = {
        --NPCKeyName
        NPCKeyName = "灯灵",
        --怪物组
        MonID = 6281,
        --BUFF  持续回血
        BUFFID = 11033,
        --连线特效ID 白色
        LinkID = 1,
        --总血量
        MonsterMaxHP = 50000,    
    },

    --BOSS2
    ["讨伐3-小怪1"] = {
        --NPCKeyName
        NPCKeyName = "助威的小宝箱",
        --怪物组
        MonID = 6282,
        --BUFF  加伤
        BUFFID = 11035,
        --连线特效ID 红色
        LinkID = 2,
        --总血量
        MonsterMaxHP = 50000,    
    },
    ["讨伐4-小怪1"] = {
        --NPCKeyName
        NPCKeyName = "助威的大宝箱",
        --怪物组
        MonID = 6283,
        --BUFF  加速
        BUFFID = 11036,
        --连线特效ID 紫色
        LinkID = 5,
        --总血量
        MonsterMaxHP = 50000,    
    },

    --BOSS3
    ["讨伐5-小怪1"] = {
        --NPCKeyName
        NPCKeyName = "作恶的小弟",
        --怪物组
        MonID = 6284,
        --BUFF  全属性
        BUFFID = 11034,
        --连线特效ID 金色
        LinkID = 4,
        --总血量
        MonsterMaxHP = 50000,    
    },
    ["讨伐6-小怪1"] = {
        --NPCKeyName
        NPCKeyName = "作恶的兵痞",
        --怪物组
        MonID = 6285,
        --BUFF  加伤
        BUFFID = 11035,
        --连线特效ID 红色
        LinkID = 2,
        --总血量
        MonsterMaxHP = 50000,    
    },

    --BOSS4
    ["讨伐7-小怪1"] = {
        --NPCKeyName
        NPCKeyName = "仪式祭祀",
        --怪物组
        MonID = 6286,
        --BUFF  全属性
        BUFFID = 11034,
        --连线特效ID 金色
        LinkID = 4,
        --总血量
        MonsterMaxHP = 50000,    
    },
    ["讨伐8-小怪1"] = {
        --NPCKeyName
        NPCKeyName = "仪式小妖",
        --怪物组
        MonID = 6287,
        --BUFF  减伤
        BUFFID = 11033,
        --连线特效ID 白色
        LinkID = 1,
        --总血量
        MonsterMaxHP = 50000,    
    },
}

--讨伐活动连线特效配置
RegionTaskConfig.ConquestLinkEffect = {
    {   --白色
        Id = 1,
        ResId = 3000200032,
        UpdateMovement = true,
        StartWidth = 0.5,
        EndWidth = 0.5,
        StartY = 0.5,
        EndY = 0.5,
    },
    {   --红色
        Id = 2,
        ResId = 3000200032,
        UpdateMovement = true,
        StartWidth = 0.5,
        EndWidth = 0.5,
        StartY = 0.5,
        EndY = 0.5,
        Color = {r=1,g=0,b=0,a=1},
    },
    {   --绿色
        Id = 3,
        ResId = 3000200032,
        UpdateMovement = true,
        StartWidth = 0.5,
        EndWidth = 0.5,
        StartY = 0.5,
        EndY = 0.5,
        Color = {r=0,g=255,b=0,a=1},
    },
    {   --金色
        Id = 4,
        ResId = 3000200032,
        UpdateMovement = true,
        StartWidth = 0.5,
        EndWidth = 0.5,
        StartY = 0.5,
        EndY = 0.5,
        Color = {r=255,g=215,b=0,a=1},
    },
    {   --紫色
        Id = 5,
        ResId = 3000200032,
        UpdateMovement = true,
        StartWidth = 0.5,
        EndWidth = 0.5,
        StartY = 0.5,
        EndY = 0.5,
        Color = {r=255,g=0,b=255,a=1},
    },
}

--BOSS配置 
RegionTaskConfig.BossConfig = {
    ["恶灵"] = {
        --怪物组
        MonID = 6276,
        --是否在开始战斗后召唤一波小怪
        FightStart = 0,
        --索引名
        BOSSKeyName = "讨伐BOSS1-主怪",
        --召唤小怪条件  暂时仅设置血量与回合数的条件，且仅能设置其中一种
        CallFactor = {
            ["Turn"] = 1,
        },
        MaxCallNum = 1,
    },

    ["奇怪的宝箱"] = {
        --怪物组
        MonID = 6277,
        --是否在开始战斗后召唤一波小怪
        FightStart = 1,
        --索引名
        BOSSKeyName = "讨伐BOSS2-主怪",
        --召唤小怪条件  暂时仅设置血量与回合数的条件，且仅能设置其中一种
        CallFactor = {
            ["Turn"] = 1,
        },
        MaxCallNum = 1,
    },

    ["凶恶大汉"] = {
        --怪物组
        MonID = 6278,
        --是否在开始战斗后召唤一波小怪
        FightStart = 1,
        --索引名
        BOSSKeyName = "讨伐BOSS3-主怪",
        --召唤小怪条件  暂时仅设置血量与回合数的条件，且仅能设置其中一种
        CallFactor = {
            ["Turn"] = 1,
        },
        MaxCallNum = 1,
    },

    ["混沌妖王"] = {
        --怪物组
        MonID = 6279,
        --是否在开始战斗后召唤一波小怪
        FightStart = 1,
        --索引名
        BOSSKeyName = "讨伐BOSS4-主怪",
        --召唤小怪条件  暂时仅设置血量与回合数的条件，且仅能设置其中一种
        CallFactor = {
            ["Turn"] = 1,
        },
        MaxCallNum = 1,
    },
}

function RegionTaskConfig.Initialization()
    RegionTaskConfig.Escort["RewardStr"] = Lua_tools.serialize(RegionTaskConfig.Escort["Reward"])
    RegionTaskConfig.Collect["RewardStr"] = Lua_tools.serialize(RegionTaskConfig.Collect["Reward"])
    RegionTaskConfig.Conquest["RewardStr"] = Lua_tools.serialize(RegionTaskConfig.Conquest["Reward"])

end
RegionTaskConfig.Initialization()