--天地大劫活动配置
TianDiDaJieConfig = {}

--参与次数上限
TianDiDaJieConfig.Join_Max = 10
--单次参加获得的活跃值
TianDiDaJieConfig.Active_Add = 0
--活跃值上限
TianDiDaJieConfig.Active_Max = 0
--活动界面 展示奖励 物品id
TianDiDaJieConfig.ShowItem = "61025,61024,20168,61022,31402"
--参与队伍最少人数 范围1-5
TianDiDaJieConfig.JoinMinNum = 1
--地图中怪物最大数量
TianDiDaJieConfig.Map_Max_Monster_Num = 20
--地图边框不刷怪区域大小
TianDiDaJieConfig.NoMonsterBorder = 10
--天地大劫战斗标签
TianDiDaJieConfig.FightTag = 10015

TianDiDaJieConfig.Exp = " level*200+1000"
TianDiDaJieConfig.Money = " level*200"

--npc刷地图keyname
TianDiDaJieConfig.Map_Config = {
	--需要随机地图的keyname 
	['MapKeyName'] = {"玄阴池","蟠桃园","两界山"},
	--每次随机几张地图（不重复）
	['MapReadomNum'] = 3,
}
--一个小时为一个周期{开始刷怪时间(分：秒)，本次怪物存在时间(秒)}
TianDiDaJieConfig.RefreshTime = {
	{"05:30", 600},
	{"15:30", 600},
	{"25:30", 600},
	{"35:30", 600},
	{"45:30", 600},
	{"55:30", 600},
}

--活动界面点击寻路的跳转坐标和地图id
TianDiDaJieConfig.MapJump_Config = {
	['玄阴池'] = {id = 213,x = 232,y = 181,},
	['蟠桃园'] = {id = 239,x = 146,y = 116,},
	['两界山'] = {id = 216,x = 100,y = 142,},
}

--奖励
--随机怪物等阶划分，和Monster_Config配置一一对应
TianDiDaJieConfig.Monster_Level = {"SSR","SR","R","N"}

--随机怪物的等阶和keyname
TianDiDaJieConfig.Monster_Config = {
	['SSR'] = {
		['KeyName'] = {"大劫-金翅大鹏王","大劫-孙悟空","大劫-太乙天尊","大劫-哪吒","大劫-观音菩萨","大劫-太上老君","大劫-镇元子"},
		['MaxNum'] = 2,
		['MinNum'] = 1,
	},
	['SR'] = {
		['KeyName'] = {"大劫-杨戬","大劫-九灵元圣","大劫-牛魔王","大劫-龙王","大劫-水德真君","大劫-小白龙","大劫-灵感大王","大劫-灵吉菩萨","大劫-唐僧","大劫-沙和尚","大劫-白骨夫人","大劫-九尾狐狸","大劫-孟婆","大劫-红孩儿"},
		['MaxNum'] = 4,
		['MinNum'] = 1,
	},
	['R'] = {
		['KeyName'] = {"大劫-猪八戒","大劫-混世魔王","大劫-程咬金","大劫-鹿力大仙","大劫-银角大王","大劫-罗刹女","大劫-如意真仙","大劫-金池长老","大劫-李靖","大劫-白无常","大劫-羊力大仙","大劫-金角大王","大劫-黑无常"},
		['MaxNum'] = 6,
		['MinNum'] = 1,
	},
	--最大最小都为0，会把剩余刷怪数量补满
	['N'] = {
		['KeyName'] = {"大劫-虎力大仙","大劫-六耳猕猴","大劫-黄风怪","大劫-黑风怪","大劫-地涌夫人","大劫-春十三娘"},
		['MaxNum'] = 0,
		['MinNum'] = 0,
	},
}

--杀死对应NPC给的特殊奖励，Level为等阶，和Reward_Level_Config配置对应。ItemList下四个参数为：keyname，概率（1-100），数量，绑定或者不绑定
TianDiDaJieConfig.Reward_Monster_Config = {
	['大劫-金翅大鹏王'] = {['Level'] = "SSR",['ItemList'] = {"金翅大鹏王信物",100,1,0,"金翅大鹏王幻身咒",1,1,0},["MonsterGen"] = 3001,},
	['大劫-孙悟空'] = {['Level'] = "SSR",['ItemList'] = {"孙悟空信物",100,1,0,"孙悟空幻身咒",1,1,0},["MonsterGen"] = 3005,},
	['大劫-太乙天尊'] = {['Level'] = "SSR",['ItemList'] = {"太乙天尊信物",100,1,0,"太乙天尊幻身咒",1,1,0},["MonsterGen"] = 3012,},
	['大劫-哪吒'] = {['Level'] = "SSR",['ItemList'] = {"SSR礼包",100,1,0,"哪吒幻身咒",1,1,0},["MonsterGen"] = 3017,},
	['大劫-观音菩萨'] = {['Level'] = "SSR",['ItemList'] = {"观音菩萨信物",100,1,0,"观音菩萨幻身咒",1,1,0},["MonsterGen"] = 3023,},
	['大劫-太上老君'] = {['Level'] = "SSR",['ItemList'] = {"太上老君信物",100,1,0,"太上老君幻身咒",1,1,0},["MonsterGen"] = 3029,},
	['大劫-镇元子'] = {['Level'] = "SSR",['ItemList'] = {"镇元子信物",100,1,0,"镇元子幻身咒",1,1,0},["MonsterGen"] = 3038,},
	['大劫-杨戬'] = {['Level'] = "SR",['ItemList'] = {"杨戬信物",100,1,0,"杨戬幻身咒",1,1,0},["MonsterGen"] = 3002,},
	['大劫-九灵元圣'] = {['Level'] = "SR",['ItemList'] = {"九灵元圣信物",100,1,0,"九灵元圣幻身咒",1,1,0},["MonsterGen"] = 3006,},
	['大劫-牛魔王'] = {['Level'] = "SR",['ItemList'] = {"牛魔王信物",100,1,0,"牛魔王幻身咒",1,1,0},["MonsterGen"] = 3010,},
	['大劫-龙王'] = {['Level'] = "SR",['ItemList'] = {"龙王信物",100,1,0,"龙王幻身咒",1,1,0},["MonsterGen"] = 3013,},
	['大劫-水德真君'] = {['Level'] = "SR",['ItemList'] = {"水德真君信物",100,1,0,"水德真君幻身咒",1,1,0},["MonsterGen"] = 3014,},
	['大劫-小白龙'] = {['Level'] = "SR",['ItemList'] = {"小白龙信物",100,1,0,"小白龙幻身咒",1,1,0},["MonsterGen"] = 3019,},
	['大劫-灵感大王'] = {['Level'] = "SR",['ItemList'] = {"灵感大王信物",100,1,0,"灵感大王幻身咒",1,1,0},["MonsterGen"] = 3020,},	
	['大劫-灵吉菩萨'] = {['Level'] = "SR",['ItemList'] = {"灵吉菩萨信物",100,1,0,"灵吉菩萨幻身咒",1,1,0},["MonsterGen"] = 3024,},
	['大劫-唐僧'] = {['Level'] = "SR",['ItemList'] = {"唐僧信物",100,1,0,"唐僧幻身咒",1,1,0},["MonsterGen"] = 3027,},
	['大劫-沙和尚'] = {['Level'] = "SR",['ItemList'] = {"沙和尚信物",100,1,0,"沙和尚幻身咒",1,1,0},["MonsterGen"] = 3030,},
	['大劫-白骨夫人'] = {['Level'] = "SR",['ItemList'] = {"白骨夫人信物",100,1,0,"白骨夫人幻身咒",1,1,0},["MonsterGen"] = 3032,},
	['大劫-九尾狐狸'] = {['Level'] = "SR",['ItemList'] = {"九尾狐狸信物",100,1,0,"九尾狐狸幻身咒",1,1,0},["MonsterGen"] = 3039,},
	['大劫-孟婆'] = {['Level'] = "SR",['ItemList'] = {"孟婆信物",100,1,0,"孟婆幻身咒",1,1,0},["MonsterGen"] = 3035,},
	['大劫-红孩儿'] = {['Level'] = "SR",['ItemList'] = {"红孩儿信物",100,1,0,"红孩儿幻身咒",1,1,0},["MonsterGen"] = 3018,},
	['大劫-猪八戒'] = {['Level'] = "R",['ItemList'] = {"猪八戒信物",100,1,0,"猪八戒幻身咒",1,1,0},["MonsterGen"] = 3003,},
	['大劫-混世魔王'] = {['Level'] = "R",['ItemList'] = {"混世魔王信物",100,1,0,"混世魔王幻身咒",1,1,0},["MonsterGen"] = 3004,},
	['大劫-程咬金'] = {['Level'] = "R",['ItemList'] = {"程咬金信物",100,1,0,"程咬金幻身咒",1,1,0},["MonsterGen"] = 3007,},
	['大劫-鹿力大仙'] = {['Level'] = "R",['ItemList'] = {"鹿力大仙信物",100,1,0,"鹿力大仙幻身咒",1,1,0},["MonsterGen"] = 3011,},
	['大劫-银角大王'] = {['Level'] = "R",['ItemList'] = {"银角大王信物",100,1,0,"银角大王幻身咒",1,1,0},["MonsterGen"] = 3015,},
	['大劫-罗刹女'] = {['Level'] = "R",['ItemList'] = {"罗刹女信物",100,1,0,"罗刹女幻身咒",1,1,0},["MonsterGen"] = 3021,},
	['大劫-如意真仙'] = {['Level'] = "R",['ItemList'] = {"如意真仙信物",100,1,0,"如意真仙幻身咒",1,1,0},["MonsterGen"] = 3025,},
	['大劫-金池长老'] = {['Level'] = "R",['ItemList'] = {"金池长老信物",100,1,0,"金池长老幻身咒",1,1,0},["MonsterGen"] = 3028,},
	['大劫-李靖'] = {['Level'] = "R",['ItemList'] = {"李靖信物",100,1,0,"李靖幻身咒",1,1,0},["MonsterGen"] = 3031,},
	['大劫-白无常'] = {['Level'] = "R",['ItemList'] = {"白无常信物",100,1,0,"白无常幻身咒",1,1,0},["MonsterGen"] = 3033,},
	['大劫-羊力大仙'] = {['Level'] = "R",['ItemList'] = {"羊力大仙信物",100,1,0,"羊力大仙幻身咒",1,1,0},["MonsterGen"] = 3040,},
	['大劫-金角大王'] = {['Level'] = "R",['ItemList'] = {"金角大王信物",100,1,0,"金角大王幻身咒",1,1,0},["MonsterGen"] = 3036,},
	['大劫-黑无常'] = {['Level'] = "R",['ItemList'] = {"黑无常信物",100,1,0,"黑无常幻身咒",1,1,0},["MonsterGen"] = 3037,},	
	['大劫-虎力大仙'] = {['Level'] = "N",['ItemList'] = {"虎力大仙信物",100,1,0,"虎力大仙幻身咒",1,1,0},["MonsterGen"] = 3008,},
	['大劫-六耳猕猴'] = {['Level'] = "N",['ItemList'] = {"六耳猕猴信物",100,1,0,"六耳猕猴幻身咒",1,1,0},["MonsterGen"] = 3009,},
	['大劫-黄风怪'] = {['Level'] = "N",['ItemList'] = {"黄风怪信物",100,1,0,"黄风怪幻身咒",1,1,0},["MonsterGen"] = 3016,},
	['大劫-黑风怪'] = {['Level'] = "N",['ItemList'] = {"黑风怪信物",100,1,0,"黑风怪幻身咒",1,1,0},["MonsterGen"] = 3022,},
	['大劫-地涌夫人'] = {['Level'] = "N",['ItemList'] = {"地涌夫人信物",100,1,0,"地涌夫人幻身咒",1,1,0},["MonsterGen"] = 3026,},
	['大劫-春十三娘'] = {['Level'] = "N",['ItemList'] = {"春十三娘信物",100,1,0,"春十三娘幻身咒",1,1,0},["MonsterGen"] = 3034,},
}

--根据等阶发放奖励的通用配置        ItemList下四个参数为：keyname，概率（1-100），数量，绑定或者不绑定
TianDiDaJieConfig.Reward_Level_Config = {
	['SSR'] = {
		Exp_UP = 2,
		Money_Type = 5,
		Money_UP = 2,
		ItemList = {"修炼丹",50,1,0,"小修炼丹",30,1,0,"宝石福袋",100,1,0,"高级宝石福袋",50,1,0,"特效卷轴礼盒3",30,1,0,"特技卷轴礼盒4",30,1,0,"翅膀升级3",2,1,0,"翅膀升级2",100,3,0},
	},
	['SR'] = {
		Exp_UP = 1.6,
		Money_Type = 5,
		Money_UP = 1.6,
		ItemList = {"修炼丹",25,1,0,"小修炼丹",25,1,0,"宝石福袋",100,1,0,"高级宝石福袋",30,1,0,"特效卷轴礼盒3",15,1,0,"特技卷轴礼盒3",30,1,0,"翅膀升级2",100,1,0,"翅膀升级1",100,2,0},
	},
	['R'] = {
		Exp_UP = 1.3,
		Money_Type = 5,
		Money_UP = 1.3,
		ItemList = {"修炼丹",10,1,0,"小修炼丹",20,1,0,"宝石福袋",100,1,0,"高级宝石福袋",10,1,0,"特技卷轴礼盒2",30,1,0,"特效卷轴礼盒1",30,1,0,"翅膀升级1",100,2,0},
	},
	['N'] = {
		Exp_UP = 1,
		Money_Type = 5,
		Money_UP = 1,
		ItemList = {"修炼丹",5,1,0,"小修炼丹",20,1,0,"宝石福袋",100,1,0,"特效卷轴礼盒1",15,1,0,"特技卷轴礼盒1",30,1,0,"翅膀升级1",100,1,0},
	},
}
